{
  "worldName": "Fantasy Adventure World",
  "registryVersion": "1.0.0",
  "lastUpdated": "2025-08-03T21:59:49.772613",
  "modules": {
    "Keep_of_Doom": {
      "moduleName": "Keep_of_Doom",
      "addedDate": "2025-08-03T21:59:41.029907",
      "themes": [
        "The party arrives in Harrow's Hollow, a small, anxious village gripped by fear. Elder Mirna Harrow asks the characters to investigate recent disappearances, including that of Scout Elen. Tensions run high as rumors of curses, spirits, and the haunted Keep of Doom swirl among the villagers. Players must gather information, win trust, and follow leads to piece together the mystery.",
        "Tracking clues and rumors, the party must brave the haunted forest and reach the Keep of Doom. Along the way, they navigate treacherous terrain, spectral ambushes, and lingering wards. The forest is alive with unnatural energies, and the party may encounter allies or enemies who help or hinder their journey.",
        "The party must reach and enter the foreboding Keep of Doom. This quest completes when the party successfully enters the keep through any means.",
        "Within the keep's depths lies the source of the curse: the vengeful spirit of Lord Thaddeus Greymont, corrupted by dark magic. The party must confront him, either by combat, exorcism, or fulfilling his final wish to find peace.",
        "Return to Harrow's Hollow after dealing with the shadow relic. This quest completes when the party returns to the village after defeating or destroying the shadow relic in the keep."
      ],
      "plotObjective": "Investigate the mysterious disappearances in Harrow's Hollow and discover the fate of Scout Elen.",
      "levelRange": {
        "min": 3,
        "max": 5
      },
      "areaCount": 5,
      "travelNarration": {
        "travelNarration": "After days of trekking through dense, whispering woods, the party emerges at the edge of Gloamwood, where shadows cling to every twisted branch and an uneasy silence lingers beneath the canopy. The air is thick with the scent of damp earth and forgotten secrets, as distant rumors of vanished travelers and a missing scout draw the adventurers deeper into the forest's enigmatic heart.",
        "dmGuidance": "Describe the transition by emphasizing the change from open or familiar terrain to the oppressive, shadowed environment of Gloamwood. Use sensory details--sounds muted by thick foliage, fleeting glimpses of movement--to build suspense. Encourage players to feel the growing tension as they approach Harrow's Hollow, setting a tone of mystery and foreboding that will carry into the investigation of the disappearances and the search for Scout Elen.",
        "generatedDate": "2025-08-03T21:59:38.417711"
      },
      "startingLocation": {
        "locationId": "A01",
        "locationName": "Harrow's Hollow General Store",
        "areaId": "HH001",
        "areaName": "Harrow's Hollow",
        "determinedBy": "AI",
        "timestamp": "2025-08-03T22:00:11.300358"
      }
    },
    "Shadows_of_Kharos": {
      "moduleName": "Shadows_of_Kharos",
      "addedDate": "2025-08-03T21:59:45.373738",
      "themes": [
        "The party arrives at Marrow's Rest Village (MRV001), shrouded in dense mist and fear. Villagers have been vanishing, and Elder Dorun pleads for help, hinting at old superstitions and darkness creeping from the marsh. The investigation reveals tensions, rumors of a secret cult, and the first hints that the evil extends beyond the village. Clues point toward the old abbey and the lighthouse on the cliffs. This sets the stage for the adventure and introduces major NPCs.",
        "As night falls on Marrow's Rest (MRV001), the party follows suspicious activity--cultists meeting in shadowed lanes and ritual symbols appearing. Brother Lintar is seen slipping toward the old abbey. Panic spreads as another villager goes missing. The party must confront the cult's operations and uncover their ambitions, which point toward the The Cursed Cliffs (ARL001) as the center of the disturbance.",
        "Clues from the village lead the party up the overgrown path to the The Cursed Cliffs (ARL001). Here, they discover evidence of old rites, Sister Hela's vigil, and the cult's attempts to summon a force from beneath. The mist thickens, and ghostly echoes warn of the Drowned King's approach. Connections between the cult, the abbey's fall, and the lighthouse's corruption become clear, pushing the party to investigate the source of the supernatural unrest.",
        "The party enters the storm-lashed The Cursed Cliffs (ARL001), drawn by the corrupted beacon. The ancient doors groan open, revealing abandoned halls and shadowy figures. Here, the party explores the entry halls and prayer chambers, piecing together the abbey's fall and encountering Mira Tidewise, the secretive lighthouse keeper. As the party delves deeper, they realize the supernatural threat is growing and that the lighthouse beacon is a crucial part of the curse threatening the entire isle.",
        "Venturing deeper into the The Cursed Cliffs (ARL001), the party navigates moss-choked corridors and perilous spiral stairs. The unnatural light pulses above, warping reality and calling forth horrors--drowned dead, cultists, and echoes of the abbey's fall. Mira Tidewise, if confronted, reveals she has been keeping dark secrets about the Drowned King and the true source of the beacon's corruption, and hints that something even deeper lies beneath the abbey.",
        "Atop the lighthouse in the Abbey Ruins (ARL001), the party confronts the source of the supernatural beacon: the bound spirit of Abbess Miralda, tormented by the Drowned King's will. The party faces a crucial decision: attempt to free the abbess, destroy the beacon, or bargain with the Drowned King's power. Their choices here will shape the fate of the abbey and the entire isle, and may uncover a path leading into the Drowned Catacombs (DC001) beneath the lighthouse.",
        "Following clues beneath the lighthouse, the party descends into the Drowned Catacombs (DC001). Here, they are assailed by chilling whispers and the oppressive sense of watching eyes. Spectral apparitions force the party to confront their own fears and the tragic history of the tombs. Navigating collapsed passageways and briny pools, they learn these catacombs once safeguarded powerful relics now sought by the Drowned King, and that the final confrontation is at hand.",
        "Deep within the Drowned Catacombs (DC001), the party finds a sealed chamber--the Briny Gate--guarded by spectral sentinels and deadly traps. The door is warded by both arcane and mundane locks, requiring negotiation with Eliad, the drowned herald, or unraveling the puzzle of the gate itself. How the party approaches this challenge will alter the supernatural hostility within the catacombs and reveal the Drowned King's true intentions.",
        "Beyond the Briny Gate lies the flooded heart of the catacombs (DC001), where the Drowned King's relic is enshrined. Here, the party must contend with the Drowned King's loyal undead and environmental hazards. The fate of the relic--whether acquired, destroyed, or purified--will determine the strength of the Drowned King and the curse upon Kharos.",
        "In a climactic confrontation in the Drowned Catacombs (DC001), the Drowned King himself emerges to claim the relic and the party's souls. The outcome depends on the party's actions: the restless dead may aid or hinder, and the catacombs begin to collapse as ancient wards fail. The party must decide whether to use, destroy, or purify the relic, choosing between escape, sacrifice, or a desperate gamble to seal the Drowned King away forever.",
        "With the fate of the relic and the Drowned King decided, the party escapes the collapsing catacombs and emerges into a dawn breaking over a changed Kharos. The unnatural light may fade, blaze anew, or leave the isle in uneasy peace. Survivors and spirits alike watch as the consequences of the party's choices ripple out, determining whether Marrow's Rest, the Abbey Ruins, and the Isle of Kharos are saved, cursed, or transformed forever."
      ],
      "plotObjective": "Investigate the disappearances and supernatural unrest plaguing the Isle of Kharos, break the curse corrupting the lighthouse, and confront the Drowned King before his ancient power reclaims the living.",
      "levelRange": {
        "min": 4,
        "max": 6
      },
      "areaCount": 3,
      "travelNarration": {
        "travelNarration": "After days of braving turbulent seas and biting winds, the party approaches the Isle of Kharos, its jagged cliffs looming like dark sentinels against a roiling gray sky. An unnatural silence hangs heavy, broken only by the distant crash of waves and the faint, eerie glow of the cursed lighthouse perched atop the precipice. Whispers of vanished villagers and restless spirits beckon the adventurers into the shadowed depths of the Cursed Cliffs, where ancient evils stir beneath the surface.",
        "dmGuidance": "Set the scene with vivid descriptions of the oppressive weather and the island's foreboding landscape to establish a mood of dread and mystery. Emphasize the isolation of the Isle of Kharos and the supernatural elements hinted at by the environment to build tension. Use unsettling sounds and fleeting glimpses of ghostly phenomena to immerse players as they prepare to explore the first dungeon area, the Cursed Cliffs.",
        "generatedDate": "2025-08-03T21:59:43.744841"
      },
      "startingLocation": {
        "locationId": "AD01",
        "locationName": "The Black Lantern Hearth",
        "areaId": "MRV001",
        "areaName": "Marrow's Rest Village",
        "determinedBy": "AI",
        "timestamp": "2025-08-03T22:01:13.084405"
      }
    },
    "The_Thornwood_Watch": {
      "moduleName": "The_Thornwood_Watch",
      "addedDate": "2025-08-03T21:59:49.772613",
      "themes": [
        "The party arrives at Rangers' Outpost to find it in crisis. Three caravans have been massacred in five days with unnatural precision. Ranger Elen, the outpost's commander, recruits the party. Her prime lead is the captured Bandit Leader, Rusk, a man now terrified of his new master. The party must interrogate Rusk to learn the location of the main bandit camp and the identity of the sorcerer, Malarok, who now commands them.",
        "Following leads from Rusk, the party ventures into the Thornwood Wilds to find the main bandit camp, located in an old, crumbling watchtower. They must overcome unnaturally aggressive wildlife and bandit patrols to reach the camp, rescue any surviving captives, and find clues about Malarok's ultimate goal.",
        "The trail leads north to a blighted part of the forest where the trees are twisted and the air hums with dark energy. The party must navigate this dangerous grove to find the source of the sorcerer's power, following the increasing cold of the iron charm from Maelo.",
        "Deep within the ruins, the party finds Malarok the Corruptor. He is performing a dark ritual to absorb the power of a large, pulsating Voidstone Shard set upon an altar. He is a formidable spellcaster, protected by elite bodyguards and the stone's foul energy. The party must defeat Malarok and destroy the Voidstone to end his threat. SPECIAL DM INSTRUCTION: When completing this plot point after Malarok's defeat, have Scout Kira suddenly receive an urgent magical message. She should refuse to join the party back to the outpost, explaining she must leave immediately for Harrow's Hollow where Scout Elen has gone missing. Have her say she'll meet Eirik there if he follows. Remove Kira from all location NPCs in this module.",
        "When the party returns to Rangers' Outpost to report their success, they discover Scout Kira has vanished! Commander Elen explains that Kira received an urgent message about Scout Elen's disappearance in Harrow's Hollow and departed immediately, leaving only a hastily scrawled note: 'Scout Elen missing in Harrow's Hollow - same signs as here. Must go now. Tell Eirik to follow if he can. -K'. Commander Elen gives the party their rewards but is clearly worried about Kira. DM NOTE: This is a plot hook to the Keep of Doom module. After giving rewards and wrapping up this module's storylines, inform players that they can travel to Harrow's Hollow to find Kira and investigate the mysterious disappearances."
      ],
      "plotObjective": "Investigate the escalating bandit attacks on the Rangers' Outpost and stop the sorcerer who is corrupting the northern wilderness.",
      "levelRange": {
        "min": 1,
        "max": 2
      },
      "areaCount": 3,
      "travelNarration": {
        "travelNarration": "The party journeys northward, leaving familiar lands behind as the trees grow taller and the air thickens with an unnatural chill. A creeping darkness seems to cling to the forest's edge, whispering of corruption and unrest within the Thornwood Watch. Each step carries the weight of unseen eyes and the promise of danger lurking beyond the twisted foliage.",
        "dmGuidance": "Describe the transition by emphasizing the shift from open terrain to dense, foreboding wilderness. Use sensory details--unnatural sounds, unsettling silence, and visual signs of decay--to build tension. Encourage players to notice subtle hints of corruption as they approach the Rangers' Outpost, setting the stage for the mystery and threats ahead.",
        "generatedDate": "2025-08-03T21:59:47.709614"
      },
      "startingLocation": {
        "locationId": "RO01",
        "locationName": "Rangers' Command Post",
        "areaId": "RO001",
        "areaName": "Rangers' Outpost",
        "determinedBy": "AI",
        "timestamp": "2025-08-03T22:00:16.814571"
      }
    }
  },
  "areas": {
    "G001": {
      "areaName": "Gloamwood",
      "areaDescription": "A dense, brooding forest where sunlight rarely pierces the canopy. Ethereal mists swirl between ancient oaks, and spirits of the restless dead prowl the trails. Travelers risk losing both their way and their lives among the twisted paths and shadowed groves.",
      "areaType": "forest",
      "dangerLevel": "medium",
      "recommendedLevel": 3,
      "climate": "temperate",
      "terrain": "dense forest, misty trails, marshy clearings",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 9,
      "module": "Keep_of_Doom",
      "addedDate": "2025-08-03T21:59:41.029907"
    },
    "HH001": {
      "areaName": "Harrow's Hollow",
      "areaDescription": "Harrow's Hollow is a medium settlement where civilization meets the frontier. Politics and intrigue mix with everyday commerce.",
      "areaType": "town",
      "dangerLevel": "low",
      "recommendedLevel": 3,
      "climate": "temperate",
      "terrain": "urban streets and buildings",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 6,
      "module": "Keep_of_Doom",
      "addedDate": "2025-08-03T21:59:41.029907"
    },
    "SK001": {
      "areaName": "Shadowfall Keep",
      "areaDescription": "A crumbling fortress perched atop a rocky hill, its towers broken and battlements thick with creeping ivy. Within, restless spirits and deadly traps await all who enter, and the cursed knight's presence warps reality itself. The very stones seem to absorb light, casting the keep in perpetual shadow regardless of the time of day.",
      "areaType": "ruins",
      "dangerLevel": "high",
      "recommendedLevel": 4,
      "climate": "temperate",
      "terrain": "rocky hill, stone fortress, crumbling architecture",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 8,
      "module": "Keep_of_Doom",
      "addedDate": "2025-08-03T21:59:41.029907"
    },
    "TBM001": {
      "areaName": "The Blighted Marches",
      "areaDescription": "A desolate moor stretching beyond the keep, scarred by ancient battles and lingering curses. Strange lights drift over the bogs at night, and only the desperate or foolhardy dare to cross these lands. The soil itself seems poisoned, growing only twisted vegetation, while miasmic mists obscure vision and disorient travelers. Time and space bend unpredictably here, where the shadow relic's influence has seeped into the very landscape over centuries.",
      "areaType": "wilderness",
      "dangerLevel": "extreme",
      "recommendedLevel": 5,
      "climate": "cold and foggy",
      "terrain": "moors, bogs, rocky outcroppings, and blasted plains",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 6,
      "module": "Keep_of_Doom",
      "addedDate": "2025-08-03T21:59:41.029907"
    },
    "TCD001": {
      "areaName": "The Cursed Dungeons",
      "areaDescription": "Beneath the keep, these ancient catacombs twist into darkness, suffused with the shadow relic's malevolent power. Echoes of suffering and the undead linger in every shadowed cell and hidden chamber. The very stones pulse with corrupted energy, and the air is thick with the taste of fear and ancient despair. Time and space seem to warp within these depths, with passages that shouldn't connect somehow leading into one another.",
      "areaType": "dungeon",
      "dangerLevel": "high",
      "recommendedLevel": 4,
      "climate": "cold and damp",
      "terrain": "underground stone passages, cells, and chambers",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 7,
      "module": "Keep_of_Doom",
      "addedDate": "2025-08-03T21:59:41.029907"
    },
    "ARL001": {
      "areaName": "The Cursed Cliffs",
      "areaDescription": "Moonlight spills through shattered stained glass, painting prismatic ghosts across salt-bitten stone as the wind whistles through the hollow tower above--a lighthouse whose beacon now flickers with eldritch, unnatural light. The air shudders with distant, bell-like chimes and the persistent tang of brine, while shadows ripple along the broken pews and moss-choked passages, hinting at secrets neither wholly forsaken nor entirely dead.",
      "areaType": "dungeon",
      "dangerLevel": "medium",
      "recommendedLevel": 5,
      "climate": "controlled - cool and damp",
      "terrain": "stone corridors and chambers",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 7,
      "module": "Shadows_of_Kharos",
      "addedDate": "2025-08-03T21:59:45.373738"
    },
    "DC001": {
      "areaName": "Drowned Catacombs",
      "areaDescription": "Stale brine seeps through fractured stone, pooling ankle-deep around toppled sarcophagi and glimmering with the reflections of phosphorescent lichen. The air thrums with the sibilant murmur of drowned voices, their whispers interrupted only by the sudden, sucking splash of something unseen slithering through the flooded gloom.",
      "areaType": "dungeon",
      "dangerLevel": "high",
      "recommendedLevel": 6,
      "climate": "controlled - cool and damp",
      "terrain": "stone corridors and chambers",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 6,
      "module": "Shadows_of_Kharos",
      "addedDate": "2025-08-03T21:59:45.373738"
    },
    "MRV001": {
      "areaName": "Marrow's Rest Village",
      "areaDescription": "Mist curls between weathered gravestones and thatched rooftops in Marrow's Rest Village, where evenings carry the faint, comforting scent of peat fires and the rhythmic chime of bone wind-clatters hung by superstitious hands. Villagers swap tales beneath creaking lanterns, casting long shadows that twist across cobbled lanes, their laughter mingling with the soft hush of the marsh beyond.",
      "areaType": "town",
      "dangerLevel": "low",
      "recommendedLevel": 4,
      "climate": "temperate",
      "terrain": "urban streets and buildings",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 5,
      "module": "Shadows_of_Kharos",
      "addedDate": "2025-08-03T21:59:45.373738"
    },
    "NCW001": {
      "areaName": "Northern Corrupted Woods",
      "areaDescription": "The Northern Corrupted Woods exist as the epicenter of Malarok's dark influence, where ancient trees have been twisted into grotesque forms by the sorcerer's Voidstone magic. Black-needled pines writhe skyward like grasping fingers, their trunks weeping dark sap that pulses with corrupt energy. The air hums with Malarok's power, making metal grow cold and thoughts sluggish. At the heart of this blighted grove lie the crumbling ruins where the sorcerer conducts his dark rituals, protected by magical wards and corrupted guardians.",
      "areaType": "wilderness",
      "dangerLevel": "high",
      "recommendedLevel": 2,
      "climate": "temperate - corrupted",
      "terrain": "blighted forest",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 5,
      "module": "The_Thornwood_Watch",
      "addedDate": "2025-08-03T21:59:49.772613"
    },
    "RO001": {
      "areaName": "Rangers' Outpost",
      "areaDescription": "Crisis transforms this frontier outpost from peaceful haven to fortress under siege. Weathered timber walkways now bear the scars of hasty fortification, while the clearing echoes with urgent voices and the clash of hastily prepared weapons. The spicy tang of pine sap mingles with smoke from signal fires and the metallic scent of fear. Rangers move with grim purpose between reinforced positions, their usual confidence replaced by the weight of impending catastrophe threatening to overwhelm their small garrison.",
      "areaType": "wilderness",
      "dangerLevel": "low",
      "recommendedLevel": 1,
      "climate": "temperate",
      "terrain": "forest clearing",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 6,
      "module": "The_Thornwood_Watch",
      "addedDate": "2025-08-03T21:59:49.772613"
    },
    "TW001": {
      "areaName": "Thornwood Wilds",
      "areaDescription": "The Thornwood Wilds writhe with predatory intelligence, their canopy of clawed branches seeming to shift and close behind intruders. Ancient trees lean inward like conspirators, their moss-choked bark weeping strange saps while root-latticed shadows conceal signs of recent violence. The air tastes of copper and fear, thick with the scent of spilled blood and the acrid smoke of bandit camps. Every snapping twig and rustling leaf might herald ambush, while drag marks in the earth tell grim stories of those who ventured here before you.",
      "areaType": "wilderness",
      "dangerLevel": "medium",
      "recommendedLevel": 1,
      "climate": "temperate",
      "terrain": "forest",
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "locationCount": 6,
      "module": "The_Thornwood_Watch",
      "addedDate": "2025-08-03T21:59:49.772613"
    }
  },
  "themes": {},
  "isolatedModules": true
}