[
  {
    "type": "rules",
    "title": "Origins",
    "content": "CORE RULEBOOK VERSION N O I S R E V K O O B E L U R E R O C\nchapter\n2\nYY",
    "page": 1,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Ancestry and Culture",
    "content": "our character’s life story begins long\nbefore your game does. You certainly don’t During the first step of character creation, you choose\nneed to write an epic novel about this your ancestry and the cultures that shaped you. The\nbackstory, but your campaign will feel more meaningful later sections of this chapter detail these choices and\nif you have a basic idea of where your character is how they impact the rules of this game.\ncoming from (and how they might be connected to the",
    "page": 1,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Story Considerations",
    "content": "other player characters). This chapter helps you build\nthat foundation, including some choices that are purely You’ll decide more about your story during step 7 of\nfor flavor, and others that significantly impact your character creation, but you can start considering the\ngame statistics. following factors now. These don’t affect your game\nstatistics, but they certainly shape who you are and",
    "page": 1,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Considering Your Origins",
    "content": "how you respond to your adventures.\nAs you begin character creation, think about the",
    "page": 1,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Occupation",
    "content": "winding path that led your character to the moment\nDepending on your character’s age and ability, you\nyour adventures start. Who and where do they come\nmight decide on a past or present occupation. This\nfrom? What have they spent their time learning, either\nexperience doesn’t have to directly tie to your decisions\nvoluntarily or under duress? How does their personality\nor role in the party, but if you wish, it can inform many\ninform their interests? Most importantly, what story\ndecisions. For example, your occupation might influence\ndo you want to set up with their origins? During step 7\nyour later choice of talents. Your choice of starting\nof character creation, you’ll solidify these details,\nequipment might reflect your occupation. And when\nbut thinking about them now can inspire your other\nyou have a break between adventures, you might even\ncharacter-building decisions.\nply your trade to earn spheres (see “Downtime”\nMost enjoyable and fulfilling stories tend to focus\nin chapter 9).\nless on the cool things a character can do, and more on\nRemember, your experience and prowess should\nthe sacrifices they make and challenges they overcome\ncorrespond to your level. A 1st-level character wouldn’t\nto accomplish those cool things. Whether your char acter\nyet be a battalionlord (see “Titles” in chapter 8), but\nis destined to bond a spren and become a Knight\nyou could tend a stable of royal Ryshadium with the\nRadiant, or whether they’ll achieve greatness all on their\nappropriate expertise.\nown, their past likely includes some degree of hardship",
    "page": 1,
    "keywords": [
      "Origin",
      "Equipment",
      "Path",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Identity",
    "content": "and perseverance. Keeping that in mind, it’s time to\nstart crafting your character’s story, beginning with Your occupation might be part of your past, but you\ntheir origins. carry much of your identity with you wherever you go.\nHow old are you? What’s your gender identity? Do you\nbelong to any groups (by circumstance or by choice)\nthat you consider part of your core identity?",
    "page": 1,
    "keywords": [
      "Origin"
    ]
  },
  {
    "type": "rules",
    "title": "Friends and Factions",
    "content": "Dalinar faces No one is an island. Consider which relationships have\nmost shaped you. This might include family (and chosen\nmemories of his past.\nfamily), old friends, trusted colleagues, bitter rivals,\nand more. Is there anyone you’re responsible for, owe a\ndebt to, or grieve? In addition to individual people, what\nfactions do you owe allegiance to? Are you connected to\nany governments, religions, guilds, armies, crime rings,\nor secret organizations?",
    "page": 1,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Ancestry Human Ancestry",
    "content": "Your ancestry reflects who you’re descended from. Most of Roshar is divided into human-ruled nations\nWhen you choose an ancestry in step 1 of character with majority-human populations.\ncreation, this affects your identity and general appear- Many ethnic groups are represented within the\nance, determines your size (see “Size and Space” in human species, some of which include distant singer\nchapter 10), and grants you talents or other abilities ancestry. Although each ethnic group shares common\nto represent unique traits of your species. physical characteristics among many of its people, these\nThough your ancestry may be an important part characteristics can express themselves very differently\nof your identity, it doesn’t define you. In a later section, across individuals. Due to the Vorin “right of travel,”\nyou’ll choose the culture and society you were raised in, international relations, and diasporas born of conflict,\nand possibly a different one you embrace today. These most nations have some degree of ethnic diversity\nsignificantly impact how you view the world and what among citizens.\nyou want for yourself, which might completely diverge The “Culture” section of this chapter discusses the\nfrom what others expect of you. nations of Roshar and the most common ethnicities of\nThis section details the two species of sapient the people who live there.\nhumanoids who live on Roshar: humans and singers. Choosing Human Ancestry\nIf you choose the human ancestry, your size is\nMedium, and you gain the following benefits at the\nspecified levels:\nAncestry Bonus Talents (Level 1, 6, 11, 16, and\n21). During step 5 of character creation, you gain\none bonus talent. As a human, you must choose this\ntalent from a heroic path (such as those in chapter 4).\nWhenever you reach a new tier (as indicated on the\nCharacter Advancement table in chapter 1), you again\ngain a bonus talent from a heroic path.\nAs usual, you must meet the prerequisites for these\ntalents (see the “Advancing Through a Path” section\nof chapter 4).",
    "page": 2,
    "keywords": [
      "Path",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Singer Ancestry",
    "content": "Singers are the indigenous population of Roshar,\nthough this knowledge was suppressed by the humans\nand lost for many Desolations. Singers can change\nforms by bonding spren during highstorms, altering\nthe singer’s appearance and abilities. Their intellectual\nand emotional capacities are equal to those of humans—\nbut unlike humans, whose abilities generally remain\nconstant, singer forms have the remarkable ability\nto temporarily amplify some abilities while others\nlie dormant.\nSingers have skin marbled with black, white, or\nred. Singer hairstrands range in hue, including orange,\nred, and black. Protective carapace covers parts of their\nbodies, though certain forms have more substantial\ncarapace, acting as biological armor. When a singer\ntakes on a new form, it can influence their physicality,\naspects of their personality, and their access (or lack\nthereof) to certain rhythms.\nRO",
    "page": 2,
    "keywords": [
      "Armor",
      "Intellect"
    ]
  },
  {
    "type": "rules",
    "title": "Choosing Singer Ancestry",
    "content": "Singers use these rhythms—which suffuse all of The “Culture” section of this chapter describes the\nRoshar—to add emotional context and depth to their listeners—a culture of singers—and also summarizes\nwords. Though most humans can’t comprehend the the experiences of other singers who live in human-\nrhythms, singers associate rhythms with specific ruled lands. You can learn even more about singers\nemotions. Each singer imbues their words with a in chapter 2 of the Stormlight World Guide.\ncadence representing their mood. With concentration,\nthey can even attune a false rhythm; sometimes singers\nIf you choose the singer ancestry, your size is\ndo this to correct themselves, and other times, to\nMedium, and you gain the following benefits at the\nmislead their audience. For example, a singer might\nspecified levels:\nattune the Rhythm of Peace to lessen their own\nanxiety—or hum to the Rhythm of Consideration to Unique Talent Tree (Level 1). Whenever you choose\npretend they’re paying close attention to an argument a new talent, you can choose it from the Singer talent\nthey find boring. Other examples of common rhythms tree in this chapter (in addition to the other trees you\ninclude the Rhythm of Determination, the Rhythm have access to).\nof the Terrors, the Rhythm of Joy, and the Rhythm Change Form (Level 1). You gain the Change Form\nof the Lost. (Singer Key) talent from the Singer tree, along with\none bonus talent that’s connected to it. Decide which\nform to begin the game in, choosing from the forms in\nthese two talents. As you gain levels, you can learn new\nforms from talents in the Singer tree.\nAncestry Bonus Talents (Level 6, 11, 16, and 21).\nEach time you reach a new tier (as indicated on the\nCharacter Advancement table in chapter 1), you again\ngain a bonus talent. You must choose it from the Singer\ntree or from any heroic path (see chapter 4).\nAs usual, you must meet the prerequisites for these\ntalents (see the “Advancing Through a Path” section\nof chapter 4).",
    "page": 3,
    "keywords": [
      "Path",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Singer Talents",
    "content": "The following talents are available to characters with\nsinger ancestry. See “Using Talents” in chapter 4 for\ninformation on how to read and use these talents.\nChange Form (Singer Key)\nPrerequisite: Singer ancestry",
    "page": 3,
    "keywords": [
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Activation:",
    "content": "You learn to bond a spren during highstorms and change\nyour form. This transformation alters not only your\nappearance, but your physical, cognitive, and spiritual\nstrengths, and even your personality.\nWhen you acquire this talent, you begin with\ntwo singer forms, dullform and mateform:\nDullform. Your form isn’t specialized, as your bonded\nspren grants no form. You can pass unnoticed as a\n“parshman” in most human societies, but you don’t\ngain other benefits from your form.\nMateform. You have bonded with a lifespren, and your\nform is specialized for reproduction.\na singer in nimbleform",
    "page": 3,
    "keywords": [
      "Strength"
    ]
  },
  {
    "type": "rules",
    "title": "Forms of Finesse Forms of Wisdom Forms of Resolve",
    "content": "Change Form (Singer Key)\nPrerequisite: Singer ancestry\nDuring a highstorm, you can change into dullform,\nmateform, or another one of your singer forms.\nsinger forms\nGain artform and nimbleform. Gain mediationform and scholarform. Gain warform and workform.\nArtform: Awareness +1, expertises in Mediationform: Presence +1. You can Aid Warform: Strength +1, deflect +1.\nPainting and Music, advantage on without spending focus. You can jump horizontally up to your\nCrafting tests and tests to entertain. Scholarform: Intellect +1. Temporarily gain movement rate and vertically up to\nNimbleform: Speed +1, focus +2. a cultural or utility expertise and a rank half your movement rate.\nin a non-surge cognitive skill. Workform: Willpower +1, ignore Exhausted.\nYou can disguise yourself as a “parshman.”",
    "page": 4,
    "keywords": [
      "Deflect",
      "Awareness",
      "Strength",
      "Intellect",
      "Advantage",
      "Willpower",
      "Speed"
    ]
  },
  {
    "type": "rules",
    "title": "Ambitious Mind",
    "content": "Prerequisite: Discipline 3+\nIncrease Cognitive defense by 2. You can\nbond a Voidspren, but once per day on\n, you must test Discipline (DC 15) or\nbe Stunned.\nForms of Destruction Forms of Expansion Forms of Mystery\nGain direform and stormform. Gain envoyform and relayform. Gain decayform and nightform.\nDireform: Strength +2, deflect +2. You can Envoyform: Intellect +1, Presence +1. Decayform: Willpower +2. You can spend\nuse Reactive Strikes to Grapple instead You know all languages and gain an 1 focus or 1 Investiture to prevent a\nof attacking. advantage on Insight tests about the character within reach from recovering\nStormform: Strength +1, Speed +1, intentions of others. health or focus.\ndeflect +1. You can use Unleash Light- Relayform: Speed +2, ignore Slowed. Spend Nightform: Awareness +1, Intellect +1,\nning as : Spend 1 focus or 1 Investiture 1 focus to gain an advantage when you focus +2. You receive unpredictable\nto make a ranged Discipline attack test Agility, Stealth, or Thievery. glimpses of the future. Preroll two d20s\n(60 feet) vs. Physical. Roll 2d8 energy each session, which you can use to\ndamage, and on a hit, the target is replace enemy and ally d20 rolls.\nDisoriented.\nicon meaning\n1 action\n2 actions\n3 actions",
    "page": 4,
    "keywords": [
      "Deflect",
      "",
      "2",
      "Awareness",
      "Strength",
      "Intellect",
      "Advantage",
      "Willpower",
      "Speed"
    ]
  },
  {
    "type": "rules",
    "title": "Artform",
    "content": "While outdoors during a highstorm, you can activate Forms of Finesse\nthis talent either to change into dullform, or to take a Prerequisite: Change Form key talent\nspren into your gemheart and change into mateform Activation:\nor any form you’ve unlocked on the Singer talent tree.\nYou gain two new singer forms—artform and nimble-\nThe type of spren bonded determines your new form.\nform—which you can transform into using your\nIn most circumstances, you can automatically find and\nChange Form.\nbond the type of spren required for that form. However,\nif the GM determines that current circumstances make\nArtform specializes in creative expression. You gain a\nthe spren difficult to locate, you might need to roleplay\nheightened awareness of the rhythms, colors, and other\nor succeed on a test to do so.\naspects of the world around you. If you have carapace,\nWhile in a form, you temporarily gain its actions,\nit’s purely cosmetic, representing radical self-expression.\nstatistic increases, and other effects (even if this temp-\norarily increases your statistics above the maximum); You’ve bonded with a creationspren. While in this form,\nthese effects only last until you assume a different you increase your Awareness by 1, and you gain utility\nform by using this talent again. You can only be in expertises in Painting and Music.\none form at a time. Additionally, you gain an advantage on Crafting tests\nand on tests related to entertaining, such as singing\nand dancing.",
    "page": 5,
    "keywords": [
      "Advantage",
      "Awareness"
    ]
  },
  {
    "type": "rules",
    "title": "Nimbleform",
    "content": "warform\nNimbleform specializes in physical and mental flexibility.\nYour protective carapace is minimal; instead, you have\nan increased range of motion and mental focus.\nYou’ve bonded with a windspren. While in this form,\nyour Speed increases by 1. When you change into this\nform, your maximum focus and current focus both\nincrease by 2, and when you assume a different form,\nboth decrease by 2.",
    "page": 5,
    "keywords": [
      "Speed"
    ]
  },
  {
    "type": "rules",
    "title": "Forms of Resolve",
    "content": "Prerequisite: Change Form key talent",
    "page": 5,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Activation:",
    "content": "You gain two new singer forms—warform and\nwork form—which you can transform into using\nyour Change Form.",
    "page": 5,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Warform",
    "content": "Warform specializes in combat, increasing your strength\nand stamina. Your body is large and covered with fierce\ncarapace, which protects you like armor. Any aversions\nyou might usually have to violence, pain, and death\nbecome slightly less pronounced in warform.\nYou’ve bonded with a painspren. While in this form,\nyour Strength increases by 1 and your deflect value\nincreases by 1. This deflect doesn’t stack with armor,\nso if you wear armor over your carapace, choose\nwhich value to use.\nAdditionally, when you move, you can jump a\nhorizontal distance up to your movement rate, or\na vertical distance up to half your movement rate,\nwithout succeeding on an Athletics test.",
    "page": 5,
    "keywords": [
      "Deflect",
      "Armor",
      "Strength"
    ]
  },
  {
    "type": "rules",
    "title": "Forms of Wisdom",
    "content": "workform Workform\nWorkform specializes in labor. This form helps you see\ntasks through to completion, granting you determination\nand stamina. You have a rugged body with modest\ncarapace ridges.\nYou’ve bonded with a gravitationspren. While in this\nform, your Willpower increases by 1, and you ignore\nthe effects of the Exhausted condition.\nAdditionally, you can easily disguise yourself to pass\nunnoticed as a “parshman” in most human societies,\nthough people might begin noticing the differences in\nyour form if you’re caught doing anything suspicious.\nPrerequisite: Change Form key talent",
    "page": 6,
    "keywords": [
      "Willpower"
    ]
  },
  {
    "type": "rules",
    "title": "Activation:",
    "content": "You gain two new singer forms—mediationform and\nscholarform—which you can transform into using your\nChange Form.",
    "page": 6,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Mediationform",
    "content": "Mediationform specializes in communication, whether\nyou’re connecting with new people or teaching those you\nknow well. Your carapace is smooth, and your facial\nfeatures are well-defined and expressive.\nYou’ve bonded with a bindspren. While in this form,\nyour Presence increases by 1.\nAdditionally, you don’t have to spend focus to use\nthe Aid reaction.",
    "page": 6,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Scholarform",
    "content": "Scholarform specializes in scholarship, enhancing your\nmental processes and memory. You become more patient\nand analytical, but you may also find yourself more\ninclined toward ambition. You have long hairstrands,\nand a cushioned lower body suited to sedentary work.\nYou’ve bonded with a logicspren. While in this form,\nyour Intellect increases by 1.\nAdditionally, when you adopt this form, choose\none cultural or utility expertise you don’t already have,\nand choose one cognitive skill that isn’t a surge skill.\nYou temporarily gain that expertise, and you tempor-\narily gain an additional rank in that skill.",
    "page": 6,
    "keywords": [
      "Intellect"
    ]
  },
  {
    "type": "rules",
    "title": "If you gain the Erudition talent from the Scholar",
    "content": "path, the expertise and skill rank you gain from your\nscholarform count as being granted by Erudition; when\nErudition allows you to reassign expertises and skills,\nyour scholarform expertise and skill are also eligible for\nreassignment. You can’t choose the same skill for both\nscholarform and Erudition.\nscholarform\n34 Chapter 2: Origins",
    "page": 6,
    "keywords": [
      "Origin",
      "Path"
    ]
  },
  {
    "type": "rules",
    "title": "Discipline test or become Stunned until the end of",
    "content": "Ambitious Mind You’ve bonded with a stormspren, a type of Void spren.\nPrerequisite: Discipline 3+; either the Forms While in this form, your Strength increases by 1, your\nof Finesse, Forms of Resolve, or Forms of Speed increases by 1, and your deflect value increases\nWisdom talent by 1. This deflect doesn’t stack with armor, so if you wear\nActivation: armor over your carapace, choose which value to use.\nAdditionally, you can use Unleash Light ning:\nYour growing thirst for power opens you to the influence\nof Odium. Unleash Lightning . Your body crackles with the Ever-\nstorm’s unnatural red lightning, which you can unleash in a\nThough you haven’t yet bonded a Voidspren, Odium’s\nviolent arc. Spend 1 focus or 1 Investiture to make a ranged\ninfluence seeps into your mind, and your Cognitive\nDiscipline attack against the Physical defense of a target\ndefense increases by 2.\nwithin 60 feet of you. Roll 2d8 energy damage. On a hit,\nIf you later acquire a talent that grants you forms of\nthe target is also Disoriented until the end of their next turn.\npower, you can then use your Change Form to attract\nIf you have recently taken on stormform, the GM might raise\na Voidspren. Bonding with this Voidspren follows the\nthe stakes on this attack due to the unpredictability of the\nsame rules as taking other forms.\narcing lightning.\nWhile bonded with a Voidspren, you become\nAs you gain ranks in Discipline, the size of this attack’s\nvulnerable to its influence; once per day when you gain\ndamage dice increases: at 4 ranks, you roll 2d10 damage\na Complication on a test, you must succeed on a DC 15\n(instead of 2d8), and at 5 ranks or more, you roll\n2d12 damage.\nyour next turn as you struggle against the Voidspren’s\ninfluence. You automatically succeed on this test if\nyou’ve sworn the First Ideal of a Radiant order.\ndireform",
    "page": 7,
    "keywords": [
      "Deflect",
      "Complication",
      "2",
      "Strength",
      "Armor",
      "Speed"
    ]
  },
  {
    "type": "rules",
    "title": "Forms of Destruction",
    "content": "Prerequisite: Ambitious Mind talent",
    "page": 7,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Activation:",
    "content": "You gain two new forms of power—direform and\nstormform—which you can transform into using\nyour Change Form.",
    "page": 7,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Direform specializes in unyielding strength and",
    "content": "persistence, and this form is commonly used to guard\nobjects or prisoners. You have substantial carapace\nwith a jagged crest of spikes running along your head\nand shoulders. You’re inclined toward obedience to your\nsuperiors but obstinacy with others.\nYou’ve bonded with a callousspren, a type of Void-\nspren. While in this form, your Strength increases by\n2 and your deflect value increases by 2. This deflect\ndoesn’t stack with armor, so if you wear armor over\nyour carapace, choose which value to use.\nAdditionally, when a character triggers a Reactive\nStrike from you, you can use that reaction to attempt\nto Grapple them instead of attacking; when you do,\nyou must spend 1 focus as usual for Reactive Strike.",
    "page": 7,
    "keywords": [
      "Deflect",
      "Armor",
      "Strength"
    ]
  },
  {
    "type": "rules",
    "title": "Stormform",
    "content": "Stormform is an elite battle form optimized for physical\nprowess and honed attacks. You’re covered in finesse-\nenhancing armored carapace that grows under your\nskin, poking through in ridges and spikes. You can\nmanipulate and unleash powerful red lighting on\nyour foes.",
    "page": 7,
    "keywords": [
      "Armor"
    ]
  },
  {
    "type": "rules",
    "title": "Forms of Expansion Relayform",
    "content": "Prerequisite: Ambitious Mind talent Relayform boasts speed and stamina ideal for scouts.\nActivation: Your agile and muscular body is protected in the front by\nYou gain two new forms of power—envoyform and light carapace with smooth edges, and aerodynamic spikes\nrelayform—which you can transform into using your run along the backs of your forearms and calves. You can\nChange Form. run great distances and avoid detection.\nEnvoyform You’ve bonded with a hastespren, a type of Voidspren.\nWhile in this form, your Speed increases by 2 and you\nEnvoyform is an embellished form often used to serve the\nignore the effects of the Slowed condition.\nadministrative needs of the Fused. Your tall form towers\nAdditionally, when you make an Agility, Stealth,\nover others, and your ornate carapace is uniquely alluring.\nor Thievery test, you can spend 1 focus to gain an\nYou comprehend any language after brief exposure and can\nadvantage on that test.\ngrasp hidden context with the subtlest of cues.\nYou’ve bonded with a zealspren, a type of Voidspren.\nWhile in this form, your Intellect increases by 1, your\nPresence increases by 1, and you can speak, read, write,\nand understand all languages.\nAdditionally, you gain an advantage on Insight tests\nmade to interpret the desires or intentions of others.\ndecayform\nrelayform\n36 Chapter 2: Origins",
    "page": 8,
    "keywords": [
      "Origin",
      "Intellect",
      "Advantage",
      "Speed"
    ]
  },
  {
    "type": "rules",
    "title": "Voidspren and Forms of Power",
    "content": "Nightform grants unpredictable visions of the future,\nWhile most spren who bond with singers are connected to and your senses become more acute, especially at night.\nthe Shards of Honor or Cultivation, Voidspren are powerful Petal-like carapace grows from your skull, framing your\nspren connected with Odium. Bonding a Voidspren ears and enhancing your ability to perceive rhythms.\nmakes you more susceptible to Odium’s influence—but In various lights, your carapace reflects different\nit also grants you access to powerful forms. The Forms of iridescent patterns.\nDestruction, Forms of Expansion, and Forms of Mystery\nYou’ve bonded with a nightspren, a type of Voidspren.\ntalents each grant you access to two of these forms of\nWhile in this form, your Awareness increases by 1 and\npower (also known as Regal forms).\nyour Intellect increases by 1. When you change into\nIn these forms, you can hum to new, malevolent\nthis form, your maximum focus and current focus both\nrhythms, and you may find that ordinary rhythms feel\nincrease by 2, and when you assume a different form,\ndistant. Your newfound power emboldens you, and\nboth decrease by 2.\ndepending on your personality, you might feel increased\nAdditionally, your bond with a nightspren has\naggression or apathy toward others. If you have a Nahel\ngranted you precognitive abilities—whether you\nbond with a Radiant spren, this helps you retain your usual\nwish them or not. While in this form, you gain the\ndisposition without a struggle.",
    "page": 9,
    "keywords": [
      "Talents",
      "Intellect",
      "Path",
      "Awareness"
    ]
  },
  {
    "type": "rules",
    "title": "Intervening Premonitions and Sporadic Premonitions",
    "content": "abilities:",
    "page": 9,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Forms of Mystery",
    "content": "Intervening Premonitions . At the start of each session,\nPrerequisite: Ambitious Mind talent\nroll two d20s and record both results. When an enemy",
    "page": 9,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Activation:",
    "content": "or willing ally you can sense makes a test, you can use this\nYou gain two new forms of power—decayform and\nreaction to replace the test’s d20 roll with one of your\nnightform—which you can transform into using your\nrecorded numbers. You can replace that number after you\nChange Form.\nsee their die roll and after they apply any advantages, but\nDecayform you must do so before the effects of the test are resolved.\nThe enigmatic decayform grants an insidious ability You lose a recorded number when you use it to replace a\nto sap the vitality of other beings. Your thin carapace d20 roll or when the session ends, whichever comes first.\nis jagged, brittle, and asymmetrical. People you touch Sporadic Premonitions . At the GM’s discretion, you might\nfind themselves less resilient while you remain in contact occasionally receive glimpses of the future at unpredictable\nwith them. This spiritual decay affects not just their times during gameplay. When this happens, the GM might\nbodies, but their minds, leaving them with nightmares describe vague flashes of imagery, sounds, and impressions\nlong after the fact. in your mind, hinting at what may come.\nYou’ve bonded with a blightspren, a type of Voidspren.\nWhile in this form, your Willpower increases by 2 Rules Tip: Actions and Reactions\nand you can use Decaying Touch:\nSome forms of power grant unique actions, reactions, or\nDecaying Touch . Before a character within your other abilities: stormform gives you the Unleash Lightning\nreach recovers health or focus, you can spend 1 focus or action, nightform gives you the Intervening Premonitions\n1 Investiture to prevent them from doing so. The character reaction, and some other forms allow you to spend focus\ndoes not regain that health or focus, but any actions, Invest- or Investiture on special effects without using an action.\niture, or other resources they spent still remain spent. In chapter 9 (“Adventuring”) and chapter 10 (“Combat”),\nyou’ll learn everything you need to know about using\nabilities like these—but if you’re not sure where to start,\nForms of power. The ability check out the “Terms from Later Chapters” sidebar in\nto reshape the world. chapter 4.",
    "page": 9,
    "keywords": [
      "",
      "Willpower",
      "Advantage"
    ]
  },
  {
    "type": "rules",
    "title": "Strength beyond anything",
    "content": "you’ve ever dreamed of having.",
    "page": 9,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Culture Rosharan Cultural Expertises",
    "content": "Your character’s culture isn’t determined by birth or Each culture’s subsection begins with a brief description\nany other single moment in time. Instead, cultural of that culture; these aren’t comprehensive, but they\nawareness can be shaped by nationality, ethnicity, serve as a quick reference for the basic information\nmigration, traveling experience, and more. The you’d know with your cultural expertise. (If you’d like,\nupcoming “Rosharan Cultural Expertises” section you can learn much more about Roshar’s nations and\npresents cultural expertises for player characters; cultures in chapter 2 of the Stormlight World Guide.)\nin step 1 of character creation, you can choose two of These summaries are followed by examples of common\nthese expertises. And if you’re playing a singer, the names from that culture. Each subsection concludes\n“Singers in Human Cultures” section helps you consider with the cultural expertise you gain if you choose that\nyour connections to the human-majority cultures of culture for your origins.\nthe world. (To learn more about using expertises, see Alethi\n“Expertises” in chapter 3.)\nAlethkar is ruled by a monarch and ten highprinces,\nYour cultural expertises can be tied to your ancestry\nand the nation is driven by war and conquest. The\nand ethnicities if you’d like them to be; this is common\nVorin religion is practiced by proxy, with ardents acting\nfor characters who grew up in or spent significant time\nas religious servants of the noble class. Gender roles are\nin cultures tied to their lineage. Alternatively, you might\nstrictly enforced in Alethi society: women are expected\nknow little about any culture related to your lineage,\nto engage in scholarly and domestic pursuits, and men\nbut be well-versed in the culture of a nation you were\nin warfare and physical labor. However, ardents have\nraised in or studied abroad in. The cultures you choose\nmore flexibility to exist outside of the harsh gender\naren’t meant to limit your character’s identity; rather,\nbinary imposed by Vorinism. The lightness of one’s eyes\nthey highlight where your cultural awareness is most\ndetermines their social caste, with the privileged dahn\ncomprehensive.\nsystem designated for lighteyes and persecuted nahn\nEither way, these expertises signify your character\nfor darkeyes. Singers and some darkeyed humans suffer\nknows information about that culture and its place\nenslavement at the hands of the upper class.\nof origin, including potential fluency in an applicable",
    "page": 10,
    "keywords": [
      "Origin",
      "HP",
      "Awareness"
    ]
  },
  {
    "type": "rules",
    "title": "Most Alethi people are tall and have tan skin and",
    "content": "language. Your level of proficiency in spoken, signed,\ndark hair. Men typically wear uniforms or work clothes.\nand written language is up to you. Consider whether",
    "page": 10,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Women either wear silk dresses called havahs that",
    "content": "you adhere to social customs around language or\ncover their left hands for propriety, or less ornate work\nnot—for example, an Alethi man might have learned\nclothes with gloves to conceal their left hands. Due to\nto read despite cultural discouragement. There are\nVorin custom, few men are literate, though most have\nno right or wrong answers here.\na rudimentary understanding of glyphs.",
    "page": 10,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Alethi Names",
    "content": "Culture as a Canvas, Not the Painting\nAdelar, Arin, Dannic, Elhamir, Ersha, Hilar, Janar,\nNo group of people is a monolith. Rather than basing\nKalith, Lanerin, Marith, Nar, Ravir, Rilin, Selith,\nyour character’s personality on the cultural details in the\nTaren, Tel, Valerin, Varda, Yaladir, Zalith.\nfollowing sections, instead think of your culture as a series",
    "page": 10,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Alethi Expertise",
    "content": "of stimuli you’ve been exposed to. Do you flourish in this\nAs a character with the Alethi expertise, you know\ncultural environment, or do you feel like an outsider? What\nthe names, locations, and highprinces of each prince-\naspects of social customs resonate with you, and which\ndom. Choose a princedom your character has lived in.\nones don’t? If you’re Herdazian, you might scoff at being\nYou can replicate its regional dialect, and you know how\ncalled “cousin” by a stranger who only shares your general\nto find vendors, public organizations, and noteworthy\nancestry—or the term might bring you a profound sense\nlandmarks there. Choose how proficient you are in\nof comfort and belonging in a foreign land. The one or two\nspoken Alethi, and reading and writing glyphs, as well\ncultures you choose are merely a canvas, and your story is\nas your literacy in women’s script (depending on your\nthe painting; how you respond to the values and traditions\ngender and regard for gender norms). Regardless of your\nof society is entirely up to you.\nreligious beliefs, you’re familiar with the basic tenets of\nVorinism, the Almighty, and the Heralds.\n38 Chapter 2: Origins",
    "page": 10,
    "keywords": [
      "Origin",
      "HP"
    ]
  },
  {
    "type": "rules",
    "title": "Azish Azish Expertise",
    "content": "The Prime Aqasix and a class of elite government As a character with the Azish expertise, you know about\nscribes called viziers lead the bureaucratic nation of the bureaucracy, Bronze Palace, Prime Aqasix, and the\nAzir and influence the Azish Empire’s member states. viziers. You can recall basic facts about each member\nWhile independent thought is encouraged in friendly state in the Azish Empire. Choose how proficient you\nand official debates, most Azish look down on those are in Azish sign language, as well as in spoken and\nwho fail to uphold procedure. Following said procedure written Azish. You can easily navigate civic buildings\nis made difficult by Azish legislature’s expansiveness. to review current laws, request the help of a constable\nMost Azish people have very dark brown skin and for law enforcement, file a complaint, or take the vizier\nblack hair. They tend to be slightly shorter than people exam. Regardless of your religious beliefs, you’re\nin Eastern Roshar. Large hats are a fixture of Azish familiar with the Kadasixes and scions.\nuniforms and civilian fashion. Wraps and robes are worn",
    "page": 11,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Herdazian",
    "content": "by all genders, with vibrant colors and symbolic patterns\nHerdaz is a verdant nation ruled by a monarch. Most\nindicating a person’s status. Azish is the official language\nof its territory is taken up by its two hundred and three\nand is spoken, signed, and written by most citizens. It is\nhog ranches, for which Herdaz is famous. There are also\ntypically spoken in pleasant, agreeable tones.\nlarge diasporas of Herdazians in neighboring nations,",
    "page": 11,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Azish Names",
    "content": "as nearly half of their population has left their ancestral\nAdebazik, Arnok, Baxtol, Chivik, Dalwa, Etosha, Falkir, land seeking opportunities or refuge from a long\nGanxir, Hauzir, Jirana, Koxi, Kunde, Maliq, Nineka, history of foreign occupation. It’s common for fellow\nRaukir, Sigwir, Tama, Tigzir, Uju, Wolu, Yemzil. Herdazians in foreign lands to warmly greet each other\nas cousins.\nVorinism is popular in Herdaz, but the nation has\nfewer ardents, and people of any status and occupation\ncan practice it personally. Most Herdazian Vorins\ncare deeply about their individual connections to\nthe Almighty and the Heralds, and they place little\nimportance on what they consider outward posturing.\nSinger ancestry in their ancient history has bestowed\nnearly all Herdazians with crystalline fingernails that\ncan function like flint when struck with a steel tool\ncalled a sparkflicker. They are also more resistant\nto poisons native to Roshar. Most Herdazians have\nmedium brown skin tones and brown hair.",
    "page": 11,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Herdazian Names",
    "content": "Aloro, Dunal, Duro, Erona, Hanol, Jonio, Kunor,\nLurio, Luron, Palor, Pinola, Polino, Relio, Sulio,\nTorona, Yorino.",
    "page": 11,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Herdazian Expertise",
    "content": "As a character with the Herdazian expertise, you\nknow of the king and prominent ranching families.\nYou know how to navigate between expansive ranches,\nincluding how to avoid the coastal areas inhabited by\nvicious greatshells. Choose how proficient you are in\nspoken and written Herdazian, along with reading\nand writing glyphs. You know about basic tools for\nranching, including sparkflickers. Regardless of your\nreligious beliefs, you’re familiar with the basic tenets\nof Herdazian Vorinism.\naleThi azish",
    "page": 11,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Iriali Iriali Names",
    "content": "Iri is ruled by three monarchs. The Iriali descended long Byrle, Drin, Ilori, Imral, Jyste, Lalys, Lyre, Lysna,\nago from offworlders, and most follow the religion of the Myi, Rallin, Rellis, Ryli, Syderim, Palir, Ynne.\nOne. They believe their mission in life is to obtain a vast Iriali Expertise\ndiversity of experiences so they can eventually merge\nAs a character with the Iriali expertise, you know\ntheir consciousnesses together at the end of the Long\nof the Iriali Triumvirate—the two kings and queen",
    "page": 12,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Trail and become one being of extensive knowledge",
    "content": "who rule together. Choose a city or rural area your\nand understanding. Their destined journey is said to\ncharacter has lived in; you know how to find vendors,\nconsist of seven worlds, of which they consider Roshar\npublic organizations, and noteworthy landmarks there.\nthe fourth. It is unknown when they must leave for the\nChoose how proficient you are in spoken and written\nfifth, so they remain ever vigilant and prepared.\nIri. Regardless of your religious beliefs, you’re familiar\nEthnic Iriali have golden skin and golden hair,\nwith the basic tenets of the One and the Long Trail.\nwhich many foreigners consider auspicious. Orna-\nYou also know basic strategies for travel and journeys,\nmental body paint adds contrast to their metallic\nsuch as management of supplies.\nfeatures. Iriali fashion favors pastel colors and flowy",
    "page": 12,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Kharbranthian",
    "content": "fabrics, and people of all genders and ages commonly\nKharbranth, the City of Bells, is an independent city-\nwear wraps. Many Iriali forgo shirts altogether or wear\nstate that largely practices Vorinism. The mountain\njust a simple bandeau. Due to their religious emphasis\nthat borders the city largely absorbs the initial impact\non journeying, items like practical shoes are considered\nof highstorms, making them milder than in neigh-\nindicators of personal preparedness and faith.\nboring regions. Once a pirate town, Kharbranth\nhas become a center of academic and medical\nachievement, supported by robust trade. Healthcare\nis free to all, including lower castes and foreigners.",
    "page": 12,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Prospective surgeons from all over Roshar compete",
    "content": "for expensive educations at the Great Concourse of\nKharbranth. Scholars of other subjects flock to the\nPalanaeum, the largest library in Roshar. Innovations\nlike a plumbing system enhanced by heating fabrials\nearn the city a reputation of luxury.\nEthnically similar to the Veden and Alethi, most\nKharbranthians have tan skin and dark hair. Although\nhuman slavery is banned in Kharbranth, this basic right\ndoesn’t extend to singers.",
    "page": 12,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Kharbranthian Names",
    "content": "Arivian, Baranam, Dorval, Harnith, Kintar, Korventh,\nLarnish, Lervian, Lorvis, Navil, Ovelgian, Sartal,\nSarvena, Telvar, Trilam, Zorlinth.",
    "page": 12,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Kharbranthian Expertise",
    "content": "As a character with the Kharbranthian expertise,\nyou’re familiar with the city’s major education systems\nand their designations. Even if you don’t know how\nto use common medicines, you know their names and\nfunctions, as well as basic hygiene measures to ward\noff rotspren. Choose how proficient you are in speaking\nKharbranthian and reading and writing glyphs, as well\nas in women’s script (depending on your gender and\nregard for gender norms). Regardless of your religious\nbeliefs, you’re familiar with the basic tenets of Vorinism,\nthe Almighty, and the Heralds.\nherdazian iriali\n40 Chapter 2: Origins",
    "page": 12,
    "keywords": [
      "Origin"
    ]
  },
  {
    "type": "rules",
    "title": "Listener Natan",
    "content": "The listeners are a group of singers who defied Odium The Vorin city-state of New Natanan is located near\nlong ago and settled near the Shattered Plains. Through the Ocean of Origins. This meager landholding is a\noral tradition, they retained their sense of identity remnant of a much larger empire that was destroyed\nduring “the long sleep,” a time when they lost access long ago. The ruins of its capital, once called Storm-\nto nearly all of their forms. seat, were reclaimed by the listeners and called Narak.\nWhen they learned King Gavilar of Alethkar Today, some Natans live as nomads that travel the\nintended to bring back the listener “gods”—the beings desolate lands previously contained in their empire.\nwho could take away their agency—the listeners had Ethnic Natans have pale blue skin and white hair.\nhim assassinated in an effort to retain their autonomy They mostly exist in isolation, either as nomads or\nand freedom from Odium’s influence. The Alethi, as citizens confined to New Natanan by vigorous\nwho called the listeners “Parshendi,” waged the War highstorms that make sea travel exceptionally perilous.\nof Reckoning as vengeance for the death of their king. Their sense of loss over their empire, particularly\nNarak became the listeners’ home, and they slowly Stormseat and its Oathgate, persists.\nrecovered more forms to fight the humans. Natan Names\nThe Song of Listing includes upward of ninety-\nAtarel, Balar, Cetsa, Farlar, Gerem, Linarat, Lortan,\none forms, but only five were recovered before the\nNalina, Nathural, Oranat, Talinan, Tsalar, Tsorem,\nEverstorm: dullform, mateform, nimbleform, warform,\nValisha, Valten, Xaltor.\nand workform. Similar to other singers, the listeners\nare humanoid and typically have red and white or\nred and black marbled skin, along with red carapace,\nred or black hair strands, and dark gray eyes.",
    "page": 13,
    "keywords": [
      "Origin"
    ]
  },
  {
    "type": "rules",
    "title": "Listener Names",
    "content": "Bredol, Eldir, Fenral, Gromil, Istarin, Jarnak, Kethan,\nKoriel, Lurin, Nalim, Nirith, Orlan, Rishai, Saren,\nTirith, Urlan, Varem, Welten.",
    "page": 13,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Listener Expertise",
    "content": "The Listener expertise is generally only available to\nsinger characters. If you’re a human who has lived or\nworked closely with the listener people, your GM can\ngive you permission to choose this expertise.\nAs a character with the Listener expertise, you’re\naware of dullform, mateform, nimbleform, warform\nand workform (even if you’re human and can’t assume\nthem yourself), and you’re familiar with the listener\ncouncil known as the Five. Depending on your interests,\nyou might know some of the songs of the listeners. You\nknow basic facts about Shattered Plains ecology. Choose\nhow proficient you are in the listener language and how\nfamiliar you are with the rhythms (though any singer\ninstinctively knows all the rhythms). You know about\nthe War of Reckoning and the Alethi armies that fight\nfor gemhearts on the plateaus.\nkharbranThian lisTener",
    "page": 13,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Natan Expertise Reshi Names",
    "content": "As a character with the Natan expertise, you’ve heard Ashi, Avand, Calsi, Fashan, Hailor, Ilesh, Isna, Jersa,\ntales of the lands the Natan people lost and what Lish, Naila, Neshor, Rifta, Sha, Tana, Trin, Vara, Wesh.\nthey were like during their full glory. You know what Reshi Expertise\nhighstorms are like at full potency, as well as defensive\nAs a character with the Reshi expertise, you know about\nmeasures you can take to protect yourself and your prop-\nthe existence of Tai-na greatshells, spren deities, and\nerty. Choose how proficient you are in Natan or another\ntales of islands going to war. You’re familiar with the\nVorin language. Regardless of your religious beliefs,\nbasic ecology of the Reshi Sea and the locations of major\nyou’re familiar with the basic tenets of Vorinism, as well\nstationary islands. Choose how proficient you are in\nas with the common Natan reverence for the moons.\nspeaking and writing Reshi. You know which resources\nReshi are unavailable in the Reshi Isles and which nations\nThe Reshi Isles are a series of misty islands and they are typically sourced from. Regardless of whether\ninhabitable Tai-na greatshell carapaces, each ruled by you choose to engage with the tradition yourself, you’re\na monarch. The Tai-na islands roam the Reshi Sea, familiar with the Reshi inclination toward fierce but\noccasionally colliding in brief conflicts. Reshi people quickly resolved social conflicts.\nworship these greatshell islands as their gods. Tourism Shin\nis common on the stationary islands.\nThe isolated nation of Shinovar is governed by Stone\nMost Reshi have brown skin, black hair, and round",
    "page": 14,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Shamans who believe that stone is sacred and that",
    "content": "faces. Unfamiliar with the horrors of devastating\nit shouldn’t be broken or walked on by commoners.\nwars, they tend to fight fiercely with words but resolve\nA mountain range offers Shinovar significant protection\ndisagreements quickly. The intonation of their language\nfrom highstorms, which are already lighter so far west.\nis sharp and spoken in quick bursts, making it difficult\nNon-native crops and animals flourish here, even those\nfor foreigners to learn.\nthat wouldn’t survive anywhere else on Roshar.\nFarmers are highly esteemed, while warriors are\nseen as lowly and destructive. Those people who\ncommit especially grievous offenses are named\nTruthless. They must take a symbolic Oathstone\nand hand it over to a master who claims authority to\ncommand them and pass ownership as they please.\nShin skin tones vary widely, including pale pink\ntones that are rarely seen outside Shinovar. Unlike most\nhuman ethnic groups on Roshar, their eyes don’t have\nepicanthic folds. Clothing customs assign vibrant colors\nto people who add to society (such as farmers), and\nduller colors to people who detract from it.",
    "page": 14,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Naming conventions include a given name followed",
    "content": "by “son,” “daughter,” or “child,” and the name of a\nparent. If a child disgraces their parent, the child must\nadd a degree of separation by repeating the middle part\nof their name and replacing the last with a grandparent’s\nname instead of their parent’s.",
    "page": 14,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Those who subtract are",
    "content": "allowed to walk on stone,\nbecause their lives are\nblasphemy.\nnaTan reshi\n42 Chapter 2: Origins",
    "page": 14,
    "keywords": [
      "Origin"
    ]
  },
  {
    "type": "rules",
    "title": "Shin Expertise",
    "content": "Shin Names Ethnic Thaylens have tan skin and long white\nAllo-daughter-Zethar, Ethsono-son-Alvo, Gesh- eyebrows that can be creatively styled as dictated by\nson-Nar, Lanethen-child-Gemth, Lorseth-son- fashion trends and personal preferences. Their hair is\nson-Thalor, Nama-son-Elhlan, Shal-daughter-Xin, usually brown or black, but some Thaylens dye their\nSzam-child-Lorn. hair in bold colors. They favor tight vests with loose\npants and skirts.",
    "page": 15,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Thaylen Names",
    "content": "As a character with the Shin expertise, you’re familiar\nwith the mild highstorms that reach the isolated Alstrym, Bnlath, Brekmynv, Bryndal, Calkl, Cazmerk,\nwestern lands of Shinovar, as well as the ecology and Creyn, Dvalnm, Elcryn, Klazmn, Mralt, Pradlvk, Tlkry,\narchitecture they support. You know how to barter Uvlost, Ylbedr.\nby diminishing the perceived value of your offerings. Thaylen Expertise\nChoose how proficient you are in speaking and writing\nAs a character with the Thaylen expertise, you’re\nShin. Regardless of your religious beliefs, you’re familiar\nfamiliar with the elective monarchy and the merchant\nwith the basic tenets of Stone Shamanism.\ncouncils. You know the names and reputations of major\nThaylen artifabrian guilds, and you’ve likely experienced fabrials\nThe island nation of Thaylenah is ruled by a monarch as a part of everyday life. You know tips to mitigate sea\nwho is elected by merchant councils and naval officers. sickness and arrange travel between the three islands\nThe nation thrives on international trade by land and and outer islets. Choose how proficient you are in speak-\nsea, and it rewards particularly industrious merchants ing and writing Thaylen. Regardless of your religious\nwith increased social status. Although the nation is beliefs, you’re familiar with the basic tenets of Vorinism,\nVorin, Thaylens are more flexible with their faith as well as the Passions.\nand tend to ignore or relax customs rigidly upheld Unkalaki\nin Jah Keved and Alethkar.",
    "page": 15,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "The Horneater Peaks are each ruled by a patriarch",
    "content": "called a nuatoma. Atop these steep and inhospitably icy\nmountains, warm crater lakes form cozy microclimates\nwhere crops flourish in balmy humidity. Unkalaki\npeople refer to these lakes as oceans. Traditional family\nstructures dictate each son’s occupation according\nto their birth order; the first two sons are assigned as\nhunters or farmers, the third as a craftsman, and the\nfourth as a warrior. Occupations for other genders tend\nto be more individualized and diverse.",
    "page": 15,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Ethnic Unkalaki get their nickname of Horneaters",
    "content": "from their abnormally strong teeth that can crush crem-\nling shells, a feature they receive through their ancient\nsinger ancestry. They tend to be tall with red hair, and\ntheir skin ranges from pale to tan. A rare few Unkalaki\ncan see spren that most humans can’t, earning the title\nof Sighted.\nIn the Unkalaki tradition, a person’s full name is\na poem. In less formal situations, they go by a single\nword or phrase from their name.",
    "page": 15,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Unkalaki Names",
    "content": "Arluno’ratha’tu, Harlun’thaoka, Ina’larataka’noom,\nKalorunel’ith, Luau’nun’iel, Tha’enithmonal’toko,\nUnla’biki’ai’karath, Yamloho’tamai’sinak.\nshin Thaylen",
    "page": 15,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Veden",
    "content": "Unkalaki Expertise There are four major ethnic groups within the\nAs a character with the Unkalaki expertise, you know borders of Jah Keved: Bav, Siln, Veden, and Unkalaki,\nabout the leadership, ecology, and myths of the oceans with Veden as the majority. Vedens comprise the\natop the peaks. Due to your lineage or lived experience, majority; they share many physical traits with the Alethi,\nyour body is familiar with breathing thin air, allowing though they most commonly have black or red hair.\nyou to keep your wits about you. Choose how proficient Their language is close enough to Alethi to be mutually\nyou are in speaking and writing Unkalaki. Regardless intelligible. Fashion trends are also closely tied between\nof your religious beliefs, you know of the gods of the the two nations.\nwaters, mountains, and trees, along with the practice In Jah Keved, sons are given a first name that\nof worshiping spren as gods. You also know of the indicates their birth order; the first four sons are named\nphenomenon of strange offworld visitors emerging Nan, Tet, Asha, and Van. Second names are chosen by\nfrom the oceans. parents. Surnames are passed down from the parent of\nthe highest dahn or nahn social order.",
    "page": 16,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Veden Names",
    "content": "Jah Keved is ruled by a king and highprinces. Social\norders for lighteyes and darkeyes are maintained and Nan Amallan, Bervash, Asha Cemdon, Dorlivana,\nendorsed by Vorinism, the primary religion of Vedens. Van Elnaha, Lerinda, Nan Qish, Tet Ridvish, Shulla,\nThe Holy Enclave in the city of Valath is the center of Varli, Tet Zashu.\nthe faith. Despite border disputes with Alethkar, the Veden Expertise\ntwo nations remain cordial. As a character with the Veden expertise, you’re familiar\nwith the king, the princedoms, and the four major\nethnic groups in Jah Keved. Choose how proficient you\nare in speaking Veden and reading and writing glyphs,\nas well as your literacy in women’s script (depending on\nyour gender and regard for gender norms). If relevant\nto your backstory, also choose how proficient you are in\nthe Alethi, Bav, or Siln languages. Regardless of your\nreligious beliefs, you’re familiar with the basic tenets of\nVorinism and current events relevant to the church.",
    "page": 16,
    "keywords": [
      "HP"
    ]
  },
  {
    "type": "rules",
    "title": "Wayfarer",
    "content": "Occupation, exile, or tourism may lead a person to live\na life of traveling from one place to the next. You could\nbe a traveling surgeon reluctant to return home to Jah\nKeved, a mercenary from Steen, or an Iriali tidereader\nsent to gain insights from the shores of faraway lands.\nWhatever the reason, the lifestyle of a perpetual\ntraveler involves learning land and sea routes between\nmajor cities, remaining aware of bandit and pirate\nrisks, and maintaining familiarity with mobile storm\nshelters, map-reading, and modes of long-distance\ntransportation.",
    "page": 16,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Wayfarer Expertise",
    "content": "As a character with the Wayfarer expertise, you know\nhow to read international map keys. You can find trust-\nworthy currency exchange hubs in major cities, which\ncan be used to switch out dun spheres for infused ones.\nFrom your travels, you’ve learned basic greetings and\na few cultural touchstones from various nations.\nunkalaki Veden\n44 Chapter 2: Origins",
    "page": 16,
    "keywords": [
      "Origin"
    ]
  },
  {
    "type": "rules",
    "title": "You can choose an expertise in a subculture within",
    "content": "Other Cultures might include forced labor, permanent separation from\nCharacters aren’t limited to the specific cultures defined loved ones, mockery, assault, malnourishment, and\nabove. With your GM’s approval, you can choose other being treated and traded as property. This is by no\ncultural expertises, such as the following: means an exhaustive list; while many aspects of harm\nare universal for all enslaved singers, others are unique\nOther Nations. You might decide to play a character\nand deeply personal.\nwho is from (or familiar with) a Rosharan culture\nYou’ve been exposed to human culture as a mostly\nthat’s not detailed above. Feel free to create your\nsilent observer. What keen insights has your character\nown expertise for any culture your character would\nmade in the time since they awakened in the Everstorm?\nreasonably be an expert on. You can find information\nWhat cultural values and traditions have they internal-\nabout many cultures in the Stormlight World Guide or\nized? Many of the singers in Azir sued their nation for\nanother canon resource.\nback pay once they awakened, seeking acknowledgment\nSubcultures. Some subcultures have values and\nthrough the legal system. Any human cultures your\nnorms that transcend national or ethnic identity.\nsinger character has lived in are well within their\nunderstanding. Which parts of those cultures do they\nsociety—for example, High Society, Military Life,\nalign with, and which harmed them or otherwise don’t\nor Underworld.\nalign? How do they generally feel toward humans now?\nSingers in Human Cultures What do they see as the best way forward?\nAlong with enslavement, consider how slaveform\nIf you’re playing a singer character, decide whether\nhas affected your character. For example, discovering\nyou’re a listener or have lived as a “parshman” in a\nrhythms that were withheld from them in slaveform\nmajority-human society. In the case of the latter, it’s\nmight be a heartbreaking experience that deepens their\nlikely your character was enslaved and persecuted by\ngrief and sense of loss, even as they strive to reclaim\nthe humans around them. Consider how the following\ntheir lives.\nelements have influenced your character.",
    "page": 17,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "A small enclave of singers known as the listeners",
    "content": "Before the arrival of the Everstorm, most singers across\nlives in the Shattered Plains. They oppose the human\nRoshar were trapped in what they know as slaveform. In\nAlethi who fight them for gemhearts under the guise\nthis form, a singer’s mind and spirit are suppressed; they\nof avenging the fallen Alethi king. These singers\nspeak only in terse phrases, apathetically follow orders,\naren’t confined to what they know as “slaveform,”\nand withhold any type of self-expression. Humans in\nthough the forms they can access are still limited\nsome nations enslaved singers in slaveform as “parsh-\ncompared to those of their forebearers. The listeners\nmen,” exploiting their inability to assert themselves or\ncling to precious clues about their heritage and lost\nobject to forced labor. These singers couldn’t process\nforms through the keeping of songs. Humans call\nor consent to what was done to them, but they later\nthe listeners “Parshendi” to differentiate them from\nawakened from this form to the nightmarish realization\n“slaveform” singers (who they know as “parshmen”),\nof all they had been through.\nas most humans understand little about the singers\nAfter the arrival of the Everstorm, enslaved singers\nand their cultures.\nregained full access to their minds and the so-called\nWhat exposure to humans has your character had,\nslaveform was no more. Unfortunately, most humans\nif any? How do they generally feel about humans?\nwho had enslaved these people continued to reject them",
    "page": 17,
    "keywords": [
      "Heritage",
      "Path"
    ]
  },
  {
    "type": "rules",
    "title": "Singer Characters in Campaigns",
    "content": "as inferior beings. Some singers held onto hope that\ntheir human countryfolk would be honorable and work Players of singer characters can work with their GM\nwith them in good faith to figure out a way forward to determine how their character fits within the time\ntogether. However, many joined Odium, seeing no other period of their campaign. The Listener expertise\nway to protect themselves from their human oppressors. requires singer ancestry or GM permission, as humans\nwere largely unaware of the listener city of Narak and",
    "page": 17,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Processing Enslavement",
    "content": "the culture of its people. All other cultural expertises",
    "page": 17,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "What are some ways your character was harmed by",
    "content": "listed are available to humans and singers, based on\ntheir enslavement? There’s no such thing as an enslaved\nwhere they have lived or spent considerable time.\nperson who is treated fairly or well. Examples of harm",
    "page": 17,
    "keywords": []
  }
]