[
  {
    "type": "rules",
    "title": "Character Creation",
    "content": "CORE RULEBOOK VERSION N O I S R E V K O O B E L U R E R O C\nchapter\n1\nAA",
    "page": 1,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Collaborating on a Story",
    "content": "s you step into the world of Roshar,\nyou start by creating the character you’ll Before you begin character creation, the GM will let\nembody in the game. From one perspective, you know the general theme of your adventure. As you\nyour character is merely a collection of statistics and begin creating your character, make decisions that mesh\nabilities that outline what you can do in the rules with this shared story. For example, if the GM says each\nof this game. But more importantly, your character player character is part of the same bridge crew, you\nis a concept, a story waiting to be told. You create probably shouldn’t create a renowned stormwarden—\neverything about them—their wants and needs, unless you and your GM can decide how they’re\ntheir strengths and weaknesses, their appearance connected to the story and its other characters.\nand personality—forging the beginnings of the story",
    "page": 1,
    "keywords": [
      "Strength"
    ]
  },
  {
    "type": "rules",
    "title": "Character Creation Steps",
    "content": "that defines their place on Roshar.\nBefore Character Creation This section guides you through the eight steps of\ncharacter creation:\nBefore you create your character, imagine who they are.\n1. Choose your origins.\nWhat sort of person do you want to play? If you’re a\n2. Choose your starting path.\nlongtime fan of the Stormlight Archive and Roshar, this\n3. Choose your attributes.\nmight be an incredibly specific idea like “a listener who\n4. Choose your skills and expertises.\nserves as keeper of songs.” If you haven’t even touched\n5. Choose your talents.\nthe novels, maybe it’s as simple as “a tough-as-nails\n6. Equip yourself.\nmercenary.” There’s no wrong way to approach this\n7. Tell your story.\nprocess! You can come up with this concept on your\n8. Calculate your final statistics.\nown, or the group can collaborate on everyone’s",
    "page": 1,
    "keywords": [
      "Origin",
      "Path",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "While following these steps in order makes your",
    "content": "characters. If you need inspiration, consider the iconic\ncalculations easiest, some players prefer taking other\nbuilds in the heroic paths of chapter 4, or think about\napproaches. For example, you could start with your\nthe example purposes, obstacles, and goals in chapter 8.\ncharacter’s story then fill out the rest of your character",
    "page": 1,
    "keywords": [
      "Path"
    ]
  },
  {
    "type": "rules",
    "title": "Telling a Compelling Story",
    "content": "around that concept. To spark inspiration, each heroic\npath in chapter 4 includes examples of how you might\nThe Stormlight Archive examines journeys of personal\nuse it to build an iconic Stormlight character archetype;\ngrowth. The character you make will change throughout\nif you’re looking for ideas, that’s a great place to start.\ngameplay, inching ever closer to their destiny. What type\nBefore starting character creation, make sure you\nof story feels important, interesting, or healing for you\nhave a copy of the Cosmere RPG character sheet;\nto tell? As you decide on their challenges and potential\nyou’ll use this to keep track of your character’s statistics\nareas of growth, do those parallel things you’re dealing\nand unique abilities. You can copy the version at the\nwith in real life? Or are you exploring new topics, hoping\nback of this book or download and print a sheet from\nto increase your empathy and understanding through\nCosmereRPG.com/character-sheets.\nthe process of roleplaying?",
    "page": 1,
    "keywords": [
      "Path"
    ]
  },
  {
    "type": "rules",
    "title": "Starting at Higher Levels",
    "content": "Most characters in this game start at level 1. If your GM\nThree Knights Radiant asks your group to create higher-level characters instead,\nsee “Starting at Higher Levels” in chapter 13.\nsearch the chasms for\nan unseen threat.",
    "page": 1,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Choosing Your Name",
    "content": "Step 1: Origins\nThe first step in defining your character is choosing\nNames hold power. Whenever you’re ready to choose\nwhere you come from, including your ancestry and\nyour character’s name, record both your name and theirs\nculture. As you think about your origins, use the tips\nat the top of your character sheet. Most people’s names\nat the beginning of chapter 2 to begin brainstorming\nare influenced by the culture they’re raised in, and the\nother aspects of your story; you’ll solidify these details\n“Culture” section of chapter 2 suggests names for each\nin step 7 of character creation.\nculture. However, your character’s name doesn’t have to",
    "page": 2,
    "keywords": [
      "Origin"
    ]
  },
  {
    "type": "rules",
    "title": "Choose Your Ancestry",
    "content": "be inspired by your culture, and you can choose it in any\nYour ancestry represents the species you’re descended way you wish; after all, many people adopt new names\nfrom. In this game, you can choose from the two later in life.\nmost common sapient species on Roshar: humans and\nsingers. Your ancestry guides your appearance, and\ndepending on the capabilities of your species, it might\nunlock some unique talents.\nOn Your Character Sheet. Choose one ancestry\nfrom the “Ancestry” section of chapter 2, then write its\nname on the front of your sheet. Record that ancestry’s\nspecial rules in their respective fields. (Your ancestry\nalso grants you one or more bonus talents; you’ll choose\nthese during step 5 when you gain your other talents.)",
    "page": 2,
    "keywords": [
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Choose Your Culture",
    "content": "Consider the society (or societies) in which you\nwere raised or have spent the most time. These are\nrepresented by cultural expertises that determine\nthe languages in which you’re most fluent, grant you\nknowledge of how to navigate those societies, and likely\ninfluence your perspective on the world.\nOn Your Character Sheet. Choose up to two\ncultural expertises from the “Culture” section of\nchapter 2, then record them on the front of your sheet.\n(You’ll learn more about expertises—and possibly gain\nmore of them—in step 4 of character creation.)",
    "page": 2,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Radiant to be strong when",
    "content": "she was weak.\n16 Chapter 1: Character Creation",
    "page": 2,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "You begin with a heroic path that grants you",
    "content": "Step 2: Starting Path On Your Character Sheet. Choose a heroic path\nfrom chapter 4, then record this starting path on the\nPlayer characters gain most of their abilities from paths,\nfront of your sheet. (For now, you’re just writing down\nreflecting their specialty, training, and experience. Your\nthe path name, but you’ll gain a skill from this path in\ncharacter’s chosen paths significantly influence the role\nstep 4, and you’ll gain at least one talent from this path\nyou play in the game. If you’ve played other roleplaying\nin step 5.)\ngames, you’re likely familiar with “classes”; paths are\nsimilar but highly flexible.\nHow Do I Create a Radiant?\nmundane abilities, but as you gain levels, you might Radiants are the most iconic wielders of powerful magical\nchoose a Radiant path and begin wielding Stormlight. surges on Roshar. When a human or singer takes special\noaths and bonds their soul with a willing sapient spren,",
    "page": 3,
    "keywords": [
      "Path"
    ]
  },
  {
    "type": "rules",
    "title": "Choose Your Starting Path",
    "content": "that person becomes Radiant, able to breathe in and\nDuring this step of character creation, you chose\nutilize Stormlight to fuel their powers. Radiants glow with\nyour first heroic path—your starting path. This\nthe Stormlight they breathe in, which increases their\nbook presents six heroic path options in chapter 4:\nphysical abilities, rapidly heals their bodies, and allows\nAgent, Envoy, Hunter, Leader, Scholar, or Warrior.\nthem to manipulate the fundamental forces of nature",
    "page": 3,
    "keywords": [
      "Path"
    ]
  },
  {
    "type": "rules",
    "title": "Each of these is summarized on the Heroic Paths",
    "content": "through Surgebinding.\nat a Glance table.\nIf you want to play a Radiant in this game, you certainly\nLater, as your character gains levels (and talents),\ncan—but when you first create your character, they aren’t\nyou can follow that path for as long as you like,\nyet Radiant (unless the GM decides otherwise, such as in a\npicking new talents from the same talent tree. Or you\ncampaign starting at level 2 or higher). To follow a Radiant\ncan branch into multiple paths—sometimes called\npath, your character must first swear Ideals; you’ll work\n“multi-pathing”—and become as diversified as fits\ntoward this goal during play, as described in chapter 5.\nyour story. You might even bond a spren and unlock\na Radiant path from chapter 5!",
    "page": 3,
    "keywords": [
      "Path",
      "Surgebinding",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Heroic Paths at a Glance",
    "content": "Path Theme Specialties Starting Skill Summary of Key Talent\nAgent A talented operative who solves problems Investigator Insight Opportunist: Reroll the plot die once\nwith a keen mind or deft hand. Spy per round.",
    "page": 3,
    "keywords": [
      "Plot Die",
      "Path"
    ]
  },
  {
    "type": "rules",
    "title": "Thief",
    "content": "Envoy An insightful negotiator who adeptly Diplomat Discipline Rousing Presence: Make an ally Determined.\ninfluences others. Faithful",
    "page": 3,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Mentor",
    "content": "Hunter A skilled sharpshooter and outdoorsperson Archer Perception Seek Quarry: Choose one character to pursue\nwho seeks and eliminates problems. Assassin and gain an advantage against.",
    "page": 3,
    "keywords": [
      "Advantage"
    ]
  },
  {
    "type": "rules",
    "title": "Tracker",
    "content": "Leader A poised commander who directs and Champion Leadership Decisive Command: Add a d4 “command die”\nguides others to be their best. Officer to an ally’s tests.",
    "page": 3,
    "keywords": [
      ""
    ]
  },
  {
    "type": "rules",
    "title": "Politico",
    "content": "Scholar An adroit thinker who excels at planning Artifabrian Lore Erudition: Gain bonus skill ranks that you\nand building. Strategist can reallocate.",
    "page": 3,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Surgeon",
    "content": "Warrior A fighter who relies on their skill, brute Duelist Athletics Vigilant Stance: Gain a fighting stance that\nstrength, or indomitable will. Shardbearer makes you more responsive and flexible\nSoldier in combat.",
    "page": 3,
    "keywords": [
      "Strength"
    ]
  },
  {
    "type": "rules",
    "title": "Gain a Starting Skill Rank",
    "content": "Step 3: Attributes Next, refer to the Movement Rate table in\nthe “Speed” section of chapter 3, and record the\nYour character’s innate characteristics are represented\nindicated movement rate on the front of your sheet.\nby six attributes: Strength, Speed, Intellect, Willpower,\nFor example, if your Speed is 3, your movement rate\nAwareness, and Presence. These form the foundation\nis 30 feet per action.\nfor your skills, physical and mental limits, and more,\nNext, refer to the Recovery Die table in the\nas detailed in chapter 3.\n“Willpower” section of chapter 3, and record the\nChoose Your Attributes indicated die size on the front of your sheet. For\nConsider which attributes best represent your strengths. example, if your Willpower is 2, your recovery\nMost humans and singers have attribute scores die is a d6.\nranging from 0 to 5—the higher your score, the more Finally, refer to the Senses Range table in\nexceptional you are in that area. When you gain levels, the “Aware ness” section of chapter 3, and record\nyou can increase your attribute scores even further. the indicated range on the front of your sheet.\nOn Your Character Sheet. Distribute 12 points For example, if your Awareness is 3, you can easily\nacross the six attributes in any order. You don’t have sense up to 20 feet even when your primary sense\nto put points in every attribute—0 is a valid attribute is obscured.\nscore—and you can’t put more than 3 points into\nStep 4: Skills and Expertises\nany attribute during this step of character creation.\nFor example, you might choose a distribution of The next step is to consider what skills and expertises\n0, 3, 2, 3, 3, and 1. your character has honed, regardless of their innate\nRecord each chosen attribute score on the front of attributes.\nyour character sheet. For now, ignore the nearby boxes\nfor your defenses, health, focus, and Investiture; you’ll\nThe starting path you chose in step 2 grants an\ncalculate these statistics in step 7.\nassociated starting skill, which is considered central\nRecord Related Statistics to characters who start on that path.\nYour attribute scores determine how good you are On Your Character Sheet. Gain a free rank in\nin related areas, including (but not limited to) the your path’s starting skill (listed on the earlier Heroic\nfollowing: Paths at a Glance table, and also in the path’s “Key\nTalent” section in chapter 4). On the front of your\n◆ Your Strength determines your lifting capacity,\nsheet, mark a checkbox next to this skill.\nrepresenting the heaviest weight you can lift.\n◆ Your Speed determines your movement rate, Choose Your Skills\nrepresenting how fast and far you can move As you play the game, you’ll frequently use skills\nunder pressure. (detailed in chapter 3) to attempt various tasks. You\n◆ Your Willpower determines your recovery die, might sneak past enemy lines with a Stealth test, or\nrepresenting how efficiently you recover health you might forage in the wilderness with a Survival test.\nand focus. You could’ve gained these skills through your education,\n◆ Your Awareness determines your senses range. line of work, or personal experience. You might even\nWhen your primary sense is overwhelmed (such attribute some to supernatural events.\nas in a thunderous highstorm or a lightless room), The more ranks you have in a skill, the better you\nyour senses range determines how far away you can are at tests and abilities that use that skill. Each skill is\nperceive using other faculties (such as smell, touch, also enhanced by the attribute listed next to it on your\nor intuition). character sheet. This combination of skill ranks plus\nWhile your Intellect and Presence are just as import- attribute score determines your skill modifier, which\nant as the above attributes, you don’t need to record you add to your test result; this reflects how effectively\nanything about them on your character sheet right now. you can perform various skill tests. For example, you’re\nOn Your Character Sheet. First, refer to the more likely to succeed on Insight tests if you also have\nLifting and Carrying Capacity table in the “Strength” high Awareness.\nsection of chapter 3, and record the indicated lifting On Your Character Sheet. Distribute 4 more\ncapacity on the front of your sheet. For example, if your ranks among the eighteen skills listed on the front of\nStrength is 2, your lifting capacity is 200 pounds. your character sheet, marking a checkbox for each\nrank. You can’t increase any skill above 2 ranks during\n18 Chapter 1: Character Creation",
    "page": 4,
    "keywords": [
      "",
      "Awareness",
      "Strength",
      "Path",
      "Intellect",
      "Willpower",
      "Speed"
    ]
  },
  {
    "type": "rules",
    "title": "CHaraCter name leVel",
    "content": "Veil 1\npatHs anCestrY\nAgent (S py ) Human\nplaYer name",
    "page": 5,
    "keywords": [
      "Path"
    ]
  },
  {
    "type": "rules",
    "title": "Shallan",
    "content": "physical cognitive spiritual\ndefense defense defense\nstrenGtH speed intelleCt willpower awareness presenCe\n0 11 1 2 15 3 3 16 3",
    "page": 5,
    "keywords": [
      "Awareness",
      "Strength",
      "Intellect",
      "Willpower",
      "Speed"
    ]
  },
  {
    "type": "rules",
    "title": "HealtH CUrrent foCUs CUrrent inVestitUre CUrrent",
    "content": "maXimUm 1 maXimUm maXimUm\n0\n10 5 0\ndefleCt\n1 aGilitY (spd) 2 CraftinG (int) 4 deCeption (pre)\n0 atHletiCs (str) 3 dedUCtion (int) 5 insiGHt (awa)\n0 HeaVY weaponrY (str) 3 disCipline (wil) 3 leadersHip (pre)\n1 liGHt weaponrY (spd) 3 intimidation (wil) 3 perCeption (awa)\n2 stealtH (spd) 2 lore (int) 3 persUasion (pre)\n1 tHieVerY (spd) 2 mediCine (int) 3 sUrViVal (awa)\n_____________ ( ___ ) _____________ ( ___ ) _____________ ( ___ )\nliftinG CapaCitY moVement reCoVerY die senses ranGe\n100 lbs. 25 ft. 1d8 20 ft. when obscured\nConditions & inJUries eXpertises",
    "page": 5,
    "keywords": [
      "Deflect",
      "Persuasion",
      "1"
    ]
  },
  {
    "type": "rules",
    "title": "Underworld",
    "content": "weapons talents\nKnife: +1 vs. Phy sical (1d4+1 keen damage) Opportunist: Once per round, you can\nreroll your plot die.\nUnarmed: +0 vs. Phy sical (1 impact damage)\nPlausible Excuse: When discovered\nskulking, spend 2 focus to feign\ninnocence.\nCosmere rpG CHaraCter sHeet | © 2025 BrotHerwise Games\nThe fronT of your compleTed characTer sheeT shows your aTTribuTes, skills, and TalenTs.",
    "page": 5,
    "keywords": [
      "1",
      "Plot Die",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Your skill modifier equals:",
    "content": "character creation, but you can otherwise choose them Step 5: Talents\nhowever you wish. (If you choose 2 ranks in a skill,\nYour path allows you to pick talents from a tree of\nmark two checkboxes by it.)\noptions each time you gain a level. Each talent grants\nAfter you distribute these ranks, calculate your skill\nyou a benefit or ability, representing the specialized\nmodifiers for each skill, even those you have no ranks in.\ncapabilities that set you apart from other characters.",
    "page": 6,
    "keywords": [
      "Path",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Gain Your Key Talent",
    "content": "your number of ranks in that skill + your score for that\nIn step 2, you chose a starting path, which determines\nskill’s attribute + any bonuses or penalties\nyour first talent. This key talent is an important ability\nRecord each skill modifier in the box to the left of that\nthat other talents in the path may further improve on.\nskill. For example, if you have 2 ranks in Insight and\nOn Your Character Sheet. You gain the first talent\nyour Awareness is 3, your Insight modifier is +5.\nin your starting path, as detailed at the top of that path’s\ntalent tree. Record this talent on the front of your sheet.",
    "page": 6,
    "keywords": [
      "Talents",
      "Path",
      "Awareness"
    ]
  },
  {
    "type": "rules",
    "title": "Choose an Ancestry Talent",
    "content": "All characters can use the eighteen skills listed on the\nIn step 1, you chose an ancestry that grants you one or\ncharacter sheet. However, you might gain additional skills\nmore bonus talents.\nduring play, representing your practice with surges (see the\nIf you’re a singer, you gain Change Form plus one\n“Using Surges” section of chapter 6) or other fantastical\ntalent that grants you starting forms (see “Choosing\nelements of the cosmere. If you later gain an additional\nSinger Ancestry” in chapter 2).\nskill, record it on the blank lines at the end of the skill list.\nIf you’re a human, you gain another talent from\na heroic path (see “Choosing Human Ancestry” in",
    "page": 6,
    "keywords": [
      "Path",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Choose Your Expertises",
    "content": "chapter 2). You can choose another talent within your\nBeyond concrete skills, your character has several areas existing path or choose the first talent of another path.\nof expertise—very specialized knowledge from personal On Your Character Sheet. Following the rules in\nexperience. You might have intricate knowledge of one the “Ancestry” section of chapter 2, choose your bonus\nkind of weapon, years of learning about an academic talent(s) and record them on the front of your sheet. If a\nsubject, or deep familiarity with a given culture. talent affects your other statistics, also record those in\nEach expertise is a simple word or phrase repre- the appropriate fields.\nsenting a subject you specialize in. If your character\nStep 6: Equipment\nis combat-focused, you’ll likely want to choose your\nfavorite weapon or armor as an expertise. If you’re To reflect your character’s background and interests,\ninterested in crafting, consider expertises on creating you gain a starting kit with equipment, currency, and\nfantastical items such as fabrials. If you’re a scholar, other resources. Some kits also have intangible benefits\nconsider cultural expertises that reflect your expanded like granting you a bond with a patron (discussed in\nknowledge about the world. chapter 8) or jump-starting your journey to becoming\nAs detailed in chapter 3, your expertise grants you a Radiant (discussed in chapter 5).\nvarious benefits; for example, if you have an expertise",
    "page": 6,
    "keywords": [
      "Equipment",
      "Armor",
      "Path"
    ]
  },
  {
    "type": "rules",
    "title": "Choose Your Starting Kit",
    "content": "in Engineering, you might automatically know if it’s safe\nEach character begins with a starting kit from chapter 7.\nto cross a rickety bridge, while another character would\nYour story isn’t bound by the names of each kit, so pick\nhave to test Deduction to come to the same conclusion.\nany kit you wish, then decide how you came to possess\nOn Your Character Sheet. You already gained\nthese items and resources. For example, if you pick the\ntwo expertises when you picked your culture in step 1 of\nCourtier kit, perhaps you inherited these items from\ncharacter creation. If your Intellect score is 1 or higher,\nyour noble Alethi family—or perhaps you illicitly gained\nyou can now choose additional expertises equal to that\nthem from your criminal career in Thaylen City.\nscore, recording them on the front of your sheet.\nOn Your Character Sheet. Choose a starting\nThe “Expertises” section of chapter 3 suggests\nkit from chapter 7, then record its contents in the\npotential subjects, but you can choose an expertise\ncorresponding fields of your sheet (such as “Weapons”\non nearly any subject you can imagine.\nor “Armor & Equipment”).\n20 Chapter 1: Character Creation",
    "page": 6,
    "keywords": [
      "Armor",
      "Intellect",
      "Equipment"
    ]
  },
  {
    "type": "rules",
    "title": "Purchase More Equipment",
    "content": "If your kit grants you marks (Roshar’s common cur-\nrency), you can use these to purchase more equipment\nif you wish (or you can save the marks for later). You\ncan buy any of the weapons, armor, or equipment listed\nin chapter 7—but pay attention to the prices! As a\nstarting character, much of the equipment is beyond\nyour means.\nOn Your Character Sheet. If you purchase extra\nequipment, record it in the corresponding fields of\nyour sheet.",
    "page": 7,
    "keywords": [
      "Armor",
      "Equipment"
    ]
  },
  {
    "type": "rules",
    "title": "Record Your Deflect Value",
    "content": "Some armor reduces the effect of impact, keen, and\nenergy damage (see “Deflect” in chapter 3). Your\ndeflect value determines how much of that damage\nyou can ignore.\nOn Your Character Sheet. If you gained armor\nduring this step, record its deflect value on the front of\nyour sheet. Otherwise, your deflect is probably 0.\nStep 7: Story\nYou now know your abilities, and you have an idea of\nwhat experiences shaped you. Now it’s time to solidify\nwho you were leading up to this moment, and even\nmore importantly, who you are today.",
    "page": 7,
    "keywords": [
      "Deflect",
      "Armor"
    ]
  },
  {
    "type": "rules",
    "title": "Choose Your Purpose and Obstacle",
    "content": "Your purpose is your soul and reason for being. It\ndoesn’t have specific mechanical effects; rather, your\npurpose is what drives you, what defines you, and what\ninspires you to the lofty goals of your adventures ahead.\nYour obstacle, on the other hand, is what stands\nin the way of your purpose, time and time again. This\ncould be pride, impulsiveness, greed, or anything else\nthat keeps you from your full potential.",
    "page": 7,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Your goals not only define what currently drives",
    "content": "On Your Character Sheet. Choose a purpose\nyou, but they grant you access to powerful items, people,\nand at least one obstacle, following the guidance in the\nand resources during your adventures. As described in\n“Purpose and Obstacle” section of chapter 8. Record\nchapter 8, when you accomplish a goal, you unlock a\nthese choices on the back of your sheet.\nreward. These can include possessions (like fabrials or\nChoose Your Goals Shardplate), relationships (like traveling companions or\nThe tangible objectives your character is personally patrons), increased status (like noble titles), and more.\nworking toward during their adventures are represented On Your Character Sheet. Create one or two goals\nby goals. These are a critical part of your character and to start with, following the guidance in the “Goals”\nhow they advance in this game, so think about them section of chapter 8. Record these goals on the back\ncarefully. Each goal should be something you’re trying of your sheet.\nto accomplish in the game; this might be as immediate For now, ignore the checkboxes to the right of each\nas “escaping imprisonment” or as lofty as “swearing an goal. As the game progresses, you’ll use these to mark\nIdeal of the Knights Radiant.” your progress toward your goals.",
    "page": 7,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "CHaraCter name leVel",
    "content": "Veil 1\npatHs anCestrY\nAgent (S py ) Human\nplaYer name",
    "page": 8,
    "keywords": [
      "Path"
    ]
  },
  {
    "type": "rules",
    "title": "Shallan",
    "content": "physical cognitive spiritual\ndefense defense defense\nstrenGtH speed intelleCt willpower awareness presenCe\n0 11 1 2 15 3 3 16 3\nCHaraCter appearanCe armor & eQUipment pUrpose\n2 knives",
    "page": 8,
    "keywords": [
      "Awareness",
      "Strength",
      "Armor",
      "Equipment",
      "Intellect",
      "Willpower",
      "Speed"
    ]
  },
  {
    "type": "rules",
    "title": "Shelter those I love from the harsh",
    "content": "Leather armor (trenchcoat) realities of an unforgiving world.",
    "page": 8,
    "keywords": [
      "Armor"
    ]
  },
  {
    "type": "rules",
    "title": "Common clothes oBstaCle",
    "content": "I can be impulsive, brash,",
    "page": 8,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Lockpick",
    "content": "and overprotective.\nNotebook, pen, and ink",
    "page": 8,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Goals",
    "content": "Bottle of Horneater white Infiltrate the Ghostbloods\n___________________________",
    "page": 8,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Backpack",
    "content": "___________________________",
    "page": 8,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Crowbar",
    "content": "___________________________",
    "page": 8,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Rope",
    "content": "___________________________\nFlint & steel\nOil lantern & oil ___________________________\ntalents, ContinUed\n5 day s street food ___________________________\n___________________________\n___________________________\nmarKs 20\n___________________________\nnotes ConneCtions\nVeil is a hard-edged Alethi woman with Ty n (Ghostblood mentor, deceased)\na mysterious past. She considers herself\na skilled con artist, but she’s not as worldyl\nas she appears. She has a weakness for\nstrong drinks and rugged bridgemen.\nCosmere rpG CHaraCter sHeet | © 2025 BrotHerwise Games\nThe back of your compleTed characTer sheeT shows equipmenT, goals, and backsTory.\n22 Chapter 1: Character Creation",
    "page": 8,
    "keywords": [
      "Equipment",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Calculate Resource Pools",
    "content": "Tell Your Story Step 8: Final Calculations\nBy now, you probably have a good idea of not only what\nCongratulations, you’ve made all the big decisions!\nyour character is, but who they are. Feel free to add\nAs the final step of character creation, use the\ndetails to your story, referring back to “Considering\ninstructions in this section to calculate and record\nYour Origins” at the beginning of chapter 2. Consider\nyour remaining statistics. Chapter 3 details how your\ndetails such as the following:\nattributes affect these and other aspects of the game.\nOccupation. What do you do for a living? Is it leading As you do so, be sure to apply any bonuses from\nyou into your adventures or distracting you from them? your talents, equipment, and other effects. For example,\nRelationships. Who are the most important—or the Collected talent increases both your Cognitive\ntroublesome—people in your life? What factions defense and Spiritual defense by 2.\nare you allied with or at odds with? If you have few\nconnections, is there a reason you prefer to work alone?\nDuring your adventures, you draw from three resource\nAnd importantly, how do you know the other player\npools, each of which has a maximum value that you’ll\ncharacters, if at all? (Work with your GM and the\nregularly deplete and recover during play (see “Health,\nother players to create connections to them.)\nFocus, and Investiture” in chapter 3).\nLoyalties. Has your loyalty to your friends or factions",
    "page": 9,
    "keywords": [
      "Origin",
      "Equipment",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Health",
    "content": "ever conflicted with your values or goals? For\nexample, perhaps you’re a middling member of the This physical resource represents your stamina and\nDiagram who once believed you were helping save resistance to minor injuries, and it increases as you level\nhumankind, but now you grapple with the depravity up. At level 1, your maximum health equals:\nof your missions. 10 + your Strength attribute + any bonuses or penalties\nPersonality. Your character’s personality will solidify\nRecord your maximum health on the front of your sheet,\nas you play the game, but you can sketch it out now.\nthen record the same number for your current health.\nWhat are your preferences, dislikes, quirks, and general\nFor example, at level 1, if your Strength is 2 and you\ndisposition? Do you take joy in the finer things and\nhave no relevant talents or other effects, your maximum\nfind poor lodgings an insufferable burden? Or are\nand current health are 12.\nyou frugal, refusing to overspend or be swindled?",
    "page": 9,
    "keywords": [
      "Talents",
      "Strength"
    ]
  },
  {
    "type": "rules",
    "title": "What makes you stand out from others who share",
    "content": "your ancestry, culture, and occupation? This cognitive resource represents mental resolve\nAppearance. What are your distinctive features? and ability to resist distraction and emotional distress.\nWhat fashions appeal to you? How tall are you? Your maximum focus equals:\nYou can record your description in the “Character 2 + your Willpower attribute + any bonuses or penalties\nAppearance” field on your character sheet.\nRecord your maximum focus on the front of your sheet,\nPossible Radiant Order. Do you want your character\nthen record the same number for your current focus.\nto eventually join a Radiant order? If so, consider\nFor example, if your Willpower is 2 and you have no\nharmonizing your story and personality with a specific\nrelevant talents or other effects, your maximum and\nOrder’s tenets, preparing to bond the corresponding\ncurrent focus are 4.\ntype of spren when the opportunity arises.",
    "page": 9,
    "keywords": [
      "Willpower",
      "Opportunity",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Investiture",
    "content": "You don’t need to know everything about your character\nAs a new character, you don’t have this spiritual\nwhen you begin your adventures; feel free to keep things\nresource yet. If you later gain Investiture (see chapter 5),\nflexible and let more of their story emerge during play.\nyour Awareness or Presence affects it.",
    "page": 9,
    "keywords": [
      "Awareness"
    ]
  },
  {
    "type": "rules",
    "title": "Calculate Defenses Character Advancement",
    "content": "Your three defenses represent your resilience against\nDuring this game, your character will face adventure\nattacks, coercion, and other unwanted effects. The\nand adversity, making friends and foes alike. As you\nhigher your defenses, the harder it is for opponents to\ndo, you’ll advance in two meaningful ways. First, you’ll\nsucceed on skill tests against you (see the “Defenses”\nearn rewards for completing personal goals; these can\nsection of chapter 3). Record your three defenses on\ngrant you powerful items, allies, and abilities, as detailed\nthe front of your sheet:\nin chapter 8. Second, as your campaign progresses,\nPhysical Defense. Your Physical defense equals your GM will indicate that your collaborative story has\n10 + your Strength attribute + your Speed attribute + reached certain milestones. When this happens, each\nany bonuses or penalties. For example, if your Strength character gains a level, representing that each of you has\nis 2 and your Speed is 3, and you have no relevant reached a significant milestone in skill and experience.\ntalents or other effects, your Physical defense is 15.",
    "page": 10,
    "keywords": [
      "Talents",
      "Speed",
      "Strength"
    ]
  },
  {
    "type": "rules",
    "title": "Tiers of Play",
    "content": "Cognitive Defense. Your Cognitive defense equals\n10 + your Intellect attribute + your Willpower The levels you advance through are divided into five\nattribute + any bonuses or penalties. For example, tiers. As your adventuring party grows in power and\nif your Intellect is 2 and your Willpower is 2, your faces more dangerous foes, each tier presents a slightly\nCognitive defense is 14. different play experience:\nSpiritual Defense. Your Spiritual defense equals\nTier 1 (Levels 1–5). Characters are just coming\n10 + your Awareness attribute + your Presence\ninto their powers and learning about their place on\nattribute + any bonuses or penalties. For example,\nRoshar. You’re dealing with issues and threats on a\nif your Awareness is 3 and your Presence is 0,\npersonal scale that affect you and the people around\nyour Spiritual defense is 13.\nyou. Your decisions may attract a spren to bond with\nComplete Other Fields your character, eventually granting you access to\nOnly a few more fields remain on your character sheet: powerful surges.\nTier 2 (Levels 6–10). Characters begin dealing with\nLevel. On the front of your sheet, record that your\nhigher-stakes issues on Roshar. At this point, some\ncharacter is level 1. This reflects your current power\ncharacters have likely gained talents in the powerful\nand experience; you’ll gain levels as you continue\nRadiant paths and sworn multiple Ideals. Other char-\nyour adventures in the cosmere. (See the “Character\nacters may have earned Shardblades of their own.\nAdvancement” section of this chapter.)\nTier 3 (Levels 11–15). Characters begin facing\nConditions & Injuries. For now, you don’t have\nchallenges on a scale that impacts all of Roshar.\nany active conditions. You’ll use this field to track",
    "page": 10,
    "keywords": [
      "Awareness",
      "Path",
      "Intellect",
      "Willpower",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "You might be fighting Fused or other powerful",
    "content": "temporary effects you experience during gameplay\nadversaries, and some characters may have earned\n(see “Conditions” and “Injuries” in chapter 9).\na set of Shardplate.\nNotes. You can use this field to keep track of any-\nTier 4 (Levels 16–20). Characters face challenges\nthing you wish.\nnot just on Roshar, but potentially stretching into\nConnections. During your adventures, you’ll use this\nthe greater cosmere. Though you’ve largely mastered\nfield to track the special connections you build with\nyour powers, you now face otherworldly foes and\nNPCs and factions. Unless you gained a connection\nunfamiliar threats.\nearlier in character creation, this field should remain\nTier 5 (Level 21+). After level 20, you’ve embraced your\nblank for now. (See “Connections” in chapter 8.)\nidentity, your powers, and your destiny. At this point,\nPlay the Game!\nyou might be leading the struggle against cosmere-level\nWith your character sheet completed, you’re ready threats—or you might retire to a life of peace after a\nto play! job well done.\nYour character’s tier primarily impacts the scope of\nyour current adventures, but it also affects a few of\nyour statistics. For example, you gain ancestry talents\nat the beginning of each tier; your maximum skill rank\nincreases along with your tier; and some of your talents\nmay become more powerful.\n24 Chapter 1: Character Creation",
    "page": 10,
    "keywords": [
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "NIRAM",
    "content": ".J",
    "page": 10,
    "keywords": []
  },
  {
    "type": "rules",
    "title": "Character Attribute Health Maximum",
    "content": "Tier Level Points Gained Skill Rank Skill Ranks Talents Gained\n1 12 attribute points 10 + STR health 2 4 skill ranks 1 talent from starting path\n(+1 from starting path) plus ancestry bonus talent(s)\n2 — +5 health 2 +2 skill ranks +1 talent\n1\n3 +1 attribute point +5 health 2 +2 skill ranks +1 talent\n4 — +5 health 2 +2 skill ranks +1 talent\n5 — +5 health 2 +2 skill ranks +1 talent\n6 +1 attribute point +4 + STR health 3 +2 skill ranks +1 talent plus ancestry bonus talent\n7 — +4 health 3 +2 skill ranks +1 talent\n2 8 — +4 health 3 +2 skill ranks +1 talent\n9 +1 attribute point +4 health 3 +2 skill ranks +1 talent\n10 — +4 health 3 +2 skill ranks +1 talent\n11 — +3 + STR health 4 +2 skill ranks +1 talent plus ancestry bonus talent\n12 +1 attribute point +3 health 4 +2 skill ranks +1 talent\n3 13 — +3 health 4 +2 skill ranks +1 talent\n14 — +3 health 4 +2 skill ranks +1 talent\n15 +1 attribute point +3 health 4 +2 skill ranks +1 talent\n16 — +2 + STR health 5 +2 skill ranks +1 talent plus ancestry bonus talent\n17 — +2 health 5 +2 skill ranks +1 talent\n4 18 +1 attribute point +2 health 5 +2 skill ranks +1 talent\n19 — +2 health 5 +2 skill ranks +1 talent\n20 — +2 health 5 +2 skill ranks +1 talent\n5 21+ — +1 health 5 Either +1 skill rank or +1 talent\n(plus ancestry bonus talent at level 21 only)",
    "page": 11,
    "keywords": [
      "Path",
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Max Skill Rank column of the Character Advancement",
    "content": "Gaining a Level You can’t have more ranks in a skill than the\nmaximum skill rank for your tier, as shown in the\nWhen you gain a level (sometimes known as “leveling\nup”), your power and abilities increase, as indicated\ntable. However, some talents may temporarily boost\non the Character Advancement table in this section.\nyour skills, which doesn’t count toward this limit.",
    "page": 12,
    "keywords": [
      "Talents"
    ]
  },
  {
    "type": "rules",
    "title": "Follow these steps to advance your character:",
    "content": "Beyond the above limitations, you can distribute\n1. Increase your character level by 1. these new skill ranks among any skills you wish,\n2. If indicated for this level, increase an attribute including surge skills gained from Radiant paths.\nand its related statistics. On your character sheet, for each skill rank\n3. Increase your health. you gain, mark one checkbox next to that skill\n4. Gain skill ranks. and increase its modifier by 1.\n5. Gain a new talent.\nStep 5: Gain a Talent\nStep 1: Increase Your Level Each time you gain a level (through level 20), you gain\nYour character starts the game at level 1, and you one talent. From level 21 onward, you gain your choice\ngain a level when your adventure reaches a milestone of either a skill rank (see step 4) or a talent, not both,\nas indicated by your GM. as indicated on the Character Advancement table.\nAdditionally, your ancestry grants you a bonus talent\nStep 2: Increase an Attribute\nat the beginning of each tier (levels 1, 6, 11, 16, and 21);\nAt levels 3, 6, 9, 12, 15, and 18, increase one attribute\nthe “Ancestry” section of chapter 2 details which bonus\nof your choice by 1, as indicated on the Character\ntalents are available to your ancestry.\nAdvancement table. (No other levels grant an attribute\nWhenever you choose a talent, you must meet its\nincrease.) You can’t increase any attribute above 5 in\nprerequisites (as described in the next section).\nthis way, but some talents may temporarily boost your\nattributes, which doesn’t count toward this limit. Prerequisites\nOn your character sheet, be sure to update skill\nSome abilities—usually talents—have prerequisites\nmodifiers and other statistics affected by this attribute;\nyou must meet before selecting or benefiting from them.\nthe “Attributes” section of chapter 3 tells you what to\nFor example, you might need to swear an Ideal or gain\nrecalculate for each attribute.\nmore ranks in a skill before you’re allowed to choose a\nStep 3: Increase Your Health particular talent. Additionally, each talent (other than\nIncrease both your maximum and current health by a key talent) requires you to have the talent preceding it\nthe amount specified for your level on the Character in the talent tree, as described in “Advancing Through\nAdvancement table. a Path” in chapter 3.\nSome effects permanently increase your statistics,\nStep 4: Gain Skill Ranks\nand these count toward such prerequisites. However,\nEach time you gain a level (through level 20), you\nif you gain a temporary bonus from talents, fabrials,\ngain 2 skill ranks of your choice. From level 21 onward,\nand similar effects, this doesn’t count toward prereq-\nyou gain your choice of either a skill rank or a talent\nuisites. For example, if you’re a singer in artform,\n(see step 5), not both, as indicated on the Character\nyour Awareness temporarily increases—but because\nAdvancement table.\nthat bonus ends when you change forms, it doesn’t\ncount toward prerequisites that require a certain\nAwareness score.\n26 Chapter 1: Character Creation",
    "page": 12,
    "keywords": [
      "Talents",
      "Path",
      "Awareness"
    ]
  },
  {
    "type": "rules",
    "title": "Choosing Rewards",
    "content": "As your character advances, you’ll complete\nHe saw it in her eyes. The anguish,\ngoals that allow you to choose special rewards\nthe frustration. The terrible nothing that\n(see chapter 8, “Goals and Rewards”). You may\nwish to think in advance and talk to your GM about clawed inside and sought to smother her.\nwhat rewards you want to work toward. If your She knew. It was there, inside. She had\ncharacter becomes a Radiant, you’ll likely spend most\nbeen broken. Then she smiled. Oh, storms.\nof your rewards on strengthening your spren bond\nShe smiled anyway.\nand swearing Ideals—but this diverts your attention\nfrom growing your status, resources, and strategic\naffiliations. So while Radiant characters tend to earn\nmore impressive personal power, heroic characters\ntend to secure monumental connections and key\nassets to dominate their enemies and write them selves\ninto legend.",
    "page": 13,
    "keywords": [
      "Strength"
    ]
  }
]